{"id":16493489,"title":"Machine Learning Crash Course","points":1926,"user":"matant","time":1519922390,"time_ago":"8 months ago","type":"link","content":"","comments":[{"id":16494238,"user":"minimaxir","time":1519926206,"time_ago":"8 months ago","type":"comment","content":"<p>Looking through the topics covered, the standard AI-course caveats (<a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=16247629\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=16247629</a>) apply.<p>Yes, AI&#x2F;ML MOOCs teach the corresponding tools well, and the creation of new tools like Keras make the field much more accessible. The obsolete gatekeeping by the AI&#x2F;ML elites who say &quot;you can&#x27;t use AI&#x2F;ML unless you have a PhD&#x2F;5 years research experience&quot; is one of the things I really hate about the industry.<p>However, contrary to the thought pieces that tend to pop up, taking and passing a crash course doesn&#x27;t mean you&#x27;ll be an expert in the field (and this applies for most MOOCs, honestly). They&#x27;re very good for learning an overview of the technology, but nothing beats applying the tools on a real-world, noisy dataset, and solving the inevitable little problems that crop up during the process.<p>Reviewing the Keras documentation (<a href=\"https:&#x2F;&#x2F;keras.io\" rel=\"nofollow\">https:&#x2F;&#x2F;keras.io</a>) and examples (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;keras-team&#x2F;keras&#x2F;tree&#x2F;master&#x2F;examples\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;keras-team&#x2F;keras&#x2F;tree&#x2F;master&#x2F;examples</a>) are honestly much better teachers of AI&#x2F;ML than any MOOC, in my opinion.<p>(Of course, Keras is now a part of TensorFlow, so there&#x27;s a neat Google vertical intergration with this crash course!)","comments":[{"id":16495604,"user":"achompas","time":1519934280,"time_ago":"8 months ago","type":"comment","content":"<p>&gt; The obsolete gatekeeping by the AI&#x2F;ML elites who say &quot;you can&#x27;t use AI&#x2F;ML unless you have a PhD&#x2F;5 years research experience&quot; is one of the things I really hate about the industry.<p>It is absolutely true that you do not need a graduate degree to apply AI&#x2F;ML to vanilla problems.<p>It is also absolutely true, in my experience, that you need a graduate-level education or years of hands-on experience to troubleshoot cases where AI&#x2F;ML fails on a deceptively-simple problem, or to tweak an AI&#x2F;ML algorithm (or develop a new one) so it can solve a novel problem.<p>That said, I think these MOOCs are good enough to get someone to a place where they can create nice &#x2F;r&#x2F;dataisbeautiful-style visualizations, or pair with a senior-level DS to deliver something.<p>(Edited to add folks who have worked on problems for years and add a final note.)","comments":[{"id":16500143,"user":"gchadwick","time":1519982349,"time_ago":"8 months ago","type":"comment","content":"<p>&gt; It is also absolutely true, in my experience, that you need a graduate-level education or years of hands-on experience to troubleshoot cases where AI&#x2F;ML fails on a deceptively-simple problem, or to tweak an AI&#x2F;ML algorithm (or develop a new one) so it can solve a novel problem.<p>How much of that is critical domain specific knowledge and how much of that is just general engineering debugging&#x2F;problem solving experience though? Certainly the person who does have the masters&#x2F;PhD and a few years of applying that to real-world ML problems will have the edge but an experienced developer who&#x27;s got a knack for maths (though no direct ML experience) may be able to get up to speed quicker than you think.  Part of that will be experience with knowing how and when to ask the right questions when you get stuck.","comments":[{"id":16505470,"user":"achompas","time":1520023128,"time_ago":"8 months ago","type":"comment","content":"<p>&gt; How much of that is critical domain specific knowledge and how much of that is just general engineering debugging&#x2F;problem solving experience though?<p>It&#x27;s both, right? You pick up problem-solving techniques as a researcher or engineer; as the former, those techniques lean towards scientific problems. Your average engineer doesn&#x27;t need to know about contrasting.<p>Again: it&#x27;s possible to learn the necessary math in your spare time! I agree!! However, it&#x27;s far easier to do it in a graduate program as a full-time job for 2-5+ years.","comments":[],"comments_count":0,"level":3,"url":"item?id=16505470"},{"id":16503593,"user":"infinite8s","time":1520011386,"time_ago":"8 months ago","type":"comment","content":"<p>The knack for maths is the important bit.","comments":[{"id":16508441,"user":"sannee","time":1520065216,"time_ago":"8 months ago","type":"comment","content":"<p>The math necessary for ML&#x2F;AI (statistics&#x2F;vector calculus) is mostly taught at undergrad level though isn&#x27;t it? So most engineers should already have it covered.","comments":[],"comments_count":0,"level":4,"url":"item?id=16508441"}],"comments_count":1,"level":3,"url":"item?id=16503593"}],"comments_count":3,"level":2,"url":"item?id=16500143"},{"id":16496809,"user":"bluetwo","time":1519941787,"time_ago":"8 months ago","type":"comment","content":"<p>I can&#x27;t help but think in 3-5 years how quaint our tools of the day will seem.","comments":[{"id":16497282,"user":"achompas","time":1519945944,"time_ago":"8 months ago","type":"comment","content":"<p>I think about this constantly.<p>Not to sound like I walked uphill in both directions back in my day or something, but I remember building models in numpy without pandas. It was tedious -- and that&#x27;s just a nice API wrapping ndarrays!","comments":[{"id":16499136,"user":"bhrgunatha","time":1519966297,"time_ago":"8 months ago","type":"comment","content":"<p>&gt; <i>Not to sound like I walked uphill in both directions back in my day</i><p>Local minima?","comments":[{"id":16500627,"user":"YeGoblynQueenne","time":1519989789,"time_ago":"8 months ago","type":"comment","content":"<p>Most likely, gradient descent with momentum.","comments":[],"comments_count":0,"level":5,"url":"item?id=16500627"},{"id":16501206,"user":"farazbabar","time":1519997612,"time_ago":"8 months ago","type":"comment","content":"<p>Oh boy, that and perturbation.","comments":[],"comments_count":0,"level":5,"url":"item?id=16501206"}],"comments_count":2,"level":4,"url":"item?id=16499136"}],"comments_count":3,"level":3,"url":"item?id=16497282"},{"id":16499127,"user":"jimbokun","time":1519966159,"time_ago":"8 months ago","type":"comment","content":"<p>I’m not so sure.<p>You can make an argument current tools haven’t really surpassed a Lisp Machine for developer productivity, or a SmallTalk environment.","comments":[],"comments_count":0,"level":3,"url":"item?id=16499127"},{"id":16499942,"user":"noobermin","time":1519978834,"time_ago":"8 months ago","type":"comment","content":"<p>Not really. I see things like leftpad and npm fails and CEOs mailing private keys they&#x27;ve stored from customers. I see the same lessons we have have to re-learn year after year.","comments":[],"comments_count":0,"level":3,"url":"item?id=16499942"}],"comments_count":6,"level":2,"url":"item?id=16496809"},{"id":16496860,"user":"lugg","time":1519942216,"time_ago":"8 months ago","type":"comment","content":"<p>What&#x27;s an example of a problem that needs that troubleshooting? (Curious)","comments":[{"id":16496984,"user":"achompas","time":1519943274,"time_ago":"8 months ago","type":"comment","content":"<p>Honestly? The exact problem I&#x27;m dealing with at work right now.<p>We&#x27;re trying to re-write our recommender for artist music stations at iHeartRadio (aka &quot;I&#x27;ll listen to Drake or Kendrick Lamar&#x27;s station at the gym today&quot;). Just today, I tried adding negative sampling to the matrix I&#x27;m factorizing, hoping it encourages spread in the embeddings learned for artists in certain types of genres.<p>I have a MS, but not a lot of research experience. It would have taken me a while to find this solution on my own. However, the moment I described this problem to my manager - a PhD graduate with several years of research and industry experience - he immediately suggested negative sampling.<p>What I learned during my MS helped me grok the math immediately. We&#x27;re adding noise to the training set and penalizing vectors lengths to avoid overfitting. Easy! Identifying a solution worth exploring? Not easy, at least without a degree or significant experience.<p>(There&#x27;s also the chance I <i>should</i> know this, in which case I have some reading to do. ¯\\_(ツ)_&#x2F;¯)","comments":[{"id":16498787,"user":"kahnjw","time":1519961814,"time_ago":"8 months ago","type":"comment","content":"<p>Aren&#x27;t you sort of glossing over the fact that he is in high up machine learning position at a company that specializes in recommender systems? Doesn&#x27;t that by itself increase the likelihood that he deeply understands implicit and explicit matrix factorization?<p>I am a good ways through my masters (second CS degree, first specializing in ML), and the more I learn, the more I realize that on any given topic, there is no guarantee the PhD in the room has the most expertise. Machine learning is a broad field that contains many subfields, methodologies, and many applications. It is a bit like computer systems or software engineering: nobody knows it all, people who are experts have intimate knowledge of a specific subset of the field. Of course, you can more around over time, but it takes years to build up expertise in even two or three subfields of machine learning.<p>Side note: sounds like we do similar work. I work at Vevo, also do a lot of matrix factorization to learn latent factors of items such as artists, videos, etc.","comments":[{"id":16499219,"user":"achompas","time":1519967530,"time_ago":"8 months ago","type":"comment","content":"<p>&gt; Aren&#x27;t you sort of glossing over the fact that he is in high up machine learning position at a company that specializes in recommender systems? Doesn&#x27;t that by itself increase the likelihood that he deeply understands implicit and explicit matrix factorization?<p>Sure thing, but someone in that position needs years of experience in recommender systems, as well as working with researchers.<p>Folks are hanging on to the PhD part of my claim, instead of the &quot;PhD or experience&quot; part. The fact is, a PhD + prior industry work means the person is close to a decade of relevant background, grad degree or not. They will unstick a co-worker far faster than an experienced backend developer with, say, a year of Keras experience.<p>&gt; Side note: sounds like we do similar work. I work at Vevo, also do a lot of matrix factorization to learn latent factors of items such as artists, videos, etc.<p>Seems like it! Email me if you&#x27;d like to chat some more offline (it&#x27;s in my profile).","comments":[],"comments_count":0,"level":5,"url":"item?id=16499219"}],"comments_count":1,"level":4,"url":"item?id=16498787"},{"id":16497609,"user":"Retric","time":1519949225,"time_ago":"8 months ago","type":"comment","content":"<p>That has little to do with a PhD, it&#x27;s the kind of thing you get with experience leading to a deeper understanding.<p>3D programming started as a field where only PHD&#x27;s had any deep understanding of what was going on simply because they had experience when nobody else did.  You see this pattern repeated frequently, in any complex domain.","comments":[{"id":16497662,"user":"achompas","time":1519949827,"time_ago":"8 months ago","type":"comment","content":"<p>Yeah, I expected this reply.<p>The PhD is sufficient but not necessary here, right? A PhD researcher&#x27;s job description is basically &quot;learn necessary math, become a domain expert, and publish papers advancing that domain.&quot; It&#x27;s difficult (but possible) to gain the same experience in industry if you don&#x27;t have a graduate degree. Which company would pay you to work through Bishop or Goodfellow for a few months? Even a principal DS doesn&#x27;t get that deal, much less a junior&#x2F;associate.<p>Also remember: my comment addressed non-vanilla cases. In your example, this is the difference between a researcher advancing 3D programming and someone using Unity or Unreal.<p>(Also, sorry for all the edits. Done now!)","comments":[{"id":16498500,"user":"Retric","time":1519958038,"time_ago":"8 months ago","type":"comment","content":"<p>I would say PHD is sufficient to <i>advance the field.</i> That&#x27;s no small thing, but only really overlaps at the start when just about anything advances the field and you need a broad focus.<p>Machine leaning for sorting peas at high speed is a very well trodden area at this point with a lot of industry specific domain knowledge.  I expect self driving cars for example to reach a similar state in ~10-25 years.<p>The risk with a PHD is you miss the specific wave.  But, if you want to stay on the bleeding edge it&#x27;s probably well worth it.","comments":[{"id":16498832,"user":"achompas","time":1519962460,"time_ago":"8 months ago","type":"comment","content":"<p>&gt; I would say PHD is sufficient to advance the field.<p>Yep! We’ve now made our way back to my initial point in response to OP. :)","comments":[],"comments_count":0,"level":7,"url":"item?id=16498832"}],"comments_count":1,"level":6,"url":"item?id=16498500"},{"id":16500072,"user":"recursivelambda","time":1519981197,"time_ago":"8 months ago","type":"comment","content":"<p>You can spend many months working through papers and books without a company paying you for that. That&#x27;s something that I continually do and have always done, in my own time (and many different fields). Sufficient and not necessary indeed.","comments":[{"id":16503677,"user":"infinite8s","time":1520011829,"time_ago":"8 months ago","type":"comment","content":"<p>It&#x27;s definitely easier to do when it&#x27;s your primary job.","comments":[],"comments_count":0,"level":7,"url":"item?id=16503677"}],"comments_count":1,"level":6,"url":"item?id=16500072"}],"comments_count":4,"level":5,"url":"item?id=16497662"}],"comments_count":5,"level":4,"url":"item?id=16497609"}],"comments_count":8,"level":3,"url":"item?id=16496984"},{"id":16497687,"user":"aoki","time":1519950055,"time_ago":"8 months ago","type":"comment","content":"<p>ali rahimi alludes to the problem of google engineers simply needing to tweak models that were previously tuned by google researchers who do have well-developed intuition [0]. because the intuitions in explicit form are at best heuristic and not necessarily even consistent, signing up to improve a model without them might result in spending indefinite time and compute resources without guarantee of positive results. which is a terrible perf-theoretic strategy...<p>[0] <a href=\"http:&#x2F;&#x2F;www.argmin.net&#x2F;2018&#x2F;01&#x2F;25&#x2F;optics&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.argmin.net&#x2F;2018&#x2F;01&#x2F;25&#x2F;optics&#x2F;</a>","comments":[],"comments_count":0,"level":3,"url":"item?id=16497687"},{"id":16499180,"user":"andbberger","time":1519966980,"time_ago":"8 months ago","type":"comment","content":"<p>Model divergence, nonsense predictions. The whole black art of ML (specifically neural nets) is coaxing them into working.<p>If you take some sophisticated deep neural net and try to train it on a binary classification where tails occurs 99% of the time - unless you specifically take measures to correct for this bias - the net will just learn to predict tails.","comments":[],"comments_count":0,"level":3,"url":"item?id=16499180"},{"id":16496962,"user":"RealCasually","time":1519943171,"time_ago":"8 months ago","type":"comment","content":"<p>Fairness and fighting adversarial examples come to mind.","comments":[],"comments_count":0,"level":3,"url":"item?id=16496962"}],"comments_count":12,"level":2,"url":"item?id=16496860"}],"comments_count":24,"level":1,"url":"item?id=16495604"},{"id":16494430,"user":"3pt14159","time":1519927346,"time_ago":"8 months ago","type":"comment","content":"<p>Unless you work for a company obviously known for their ML the &quot;expertise&quot; out there right now is brutal. People are building recommendation engines without knowing the very, very, very basics like Jaccard indexes, ROC Curves, or topic drift. I&#x27;ve even had to explain type two error to someone working on one of these before.<p>I agree with your general thrust, and you&#x27;re right, messy data is often 95% of the problem, but even going through just the Google courses will put people in the top 15% in most cities.","comments":[{"id":16495698,"user":"BadCookie","time":1519934842,"time_ago":"8 months ago","type":"comment","content":"<p>I took a machine learning graduate-level course from Andrew Ng himself, and I don&#x27;t recall learning about Jaccard indexes or topic drift. Maybe your sense of what counts as &quot;very, very, very basic&quot; is skewed toward your own experience. There&#x27;s a phenomenon known to psychologists where people tend to think that the stuff that they know is very easy and basic, so they conclude that anybody who doesn&#x27;t know what they know must be uneducated. But then it turns out that the person you think is uneducated knows about a bunch of surprising stuff that you don&#x27;t. I can&#x27;t remember the term for this phenomenon, but I often remember it whenever I find myself beginning to judge another person&#x27;s expertise. This phenomenon is also super relevant to the failings of most technical interviews, in my opinion.","comments":[{"id":16495842,"user":"eanzenberg","time":1519935613,"time_ago":"8 months ago","type":"comment","content":"<p>There&#x27;s a bit of snobbiness in different areas of tech, although there also are in different areas of academia and research. At the end of the day, the most successful people are the ones who wouldn&#x27;t dismiss a DS who didn&#x27;t know &quot;Jaccard index&quot; or &quot;the Halting Problem&quot;.","comments":[],"comments_count":0,"level":3,"url":"item?id=16495842"},{"id":16508844,"user":"aaron987","time":1520076697,"time_ago":"8 months ago","type":"comment","content":"<p>Are you referring to the Curse of Knowledge?<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Curse_of_knowledge\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Curse_of_knowledge</a><p>What you are describing also sounds a little like the Dunning-Kruger effect:<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Dunning%E2%80%93Kruger_effect\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Dunning%E2%80%93Kruger_effect</a>","comments":[],"comments_count":0,"level":3,"url":"item?id=16508844"},{"id":16497385,"time":1519946911,"time_ago":"8 months ago","type":"comment","content":"[deleted]","deleted":true,"comments":[],"comments_count":0,"level":3,"url":"item?id=16497385"},{"id":16506162,"user":"mixmastamyk","time":1520028148,"time_ago":"8 months ago","type":"comment","content":"<p>Oh, wish I knew the name of that phenomenon as well.","comments":[],"comments_count":0,"level":3,"url":"item?id=16506162"}],"comments_count":4,"level":2,"url":"item?id=16495698"},{"id":16494724,"user":"eanzenberg","time":1519929262,"time_ago":"8 months ago","type":"comment","content":"<p>You probably can&#x27;t communicate effectively. If you are describing &quot;Type two error&quot; of course you will get eyes glossing over. A huge problem with research fields is their terse banal labels. Confusion matrix anyone?","comments":[{"id":16495576,"user":"ardit33","time":1519934118,"time_ago":"8 months ago","type":"comment","content":"<p>Or you can just say &quot;false negative&quot;, and every CS major will understand you.<p>I find people in Math and CS have often very different names for the same type of concepts and they could easy understand each other if they stuck to the more common terms.<p>In this case, saying: TYPE 2 ERROR, makes you look like you are trying too hard.","comments":[{"id":16495853,"user":"eanzenberg","time":1519935673,"time_ago":"8 months ago","type":"comment","content":"<p>It&#x27;s also extremely confusing because very few people remember type 1 vs 2 but false positive&#x2F;negative has intuitive understanding.","comments":[],"comments_count":0,"level":4,"url":"item?id=16495853"},{"id":16497260,"user":"aoki","time":1519945759,"time_ago":"8 months ago","type":"comment","content":"<p>type ii error is statistics, not mathematics. there is no equivalent concept in CS because type ii error relates specifically to statistical inference and hypothesis testing.<p>that said, if you are just pointing to a box in a confusion matrix and saying &quot;TYPE II ERROR,&quot; you are probably trying too hard.","comments":[{"id":16497629,"user":"eachro","time":1519949406,"time_ago":"8 months ago","type":"comment","content":"<p>Eh, but if you&#x27;ve taken a machine learning course, you should have seen the notion of false positive&#x2F;false negative when you cover any kind of classification technique.","comments":[{"id":16498261,"user":"aoki","time":1519955525,"time_ago":"8 months ago","type":"comment","content":"<p>but they&#x27;re not actually equivalent, in spite of tables like this [0]. type ii error is a false negative result <i>in the context of a test</i>, where you have to understand which hypothesis is which and exactly what you are accepting or rejecting (hypotheses are not always as simple as hotdog&#x2F;not-hotdog); if your listener doesn&#x27;t know what statistical tests mean or wasn&#x27;t following the setup, they have to stop you and ask.<p>[0] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Type_I_and_type_II_errors#Table_of_error_types\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Type_I_and_type_II_errors#Tabl...</a>","comments":[],"comments_count":0,"level":6,"url":"item?id=16498261"}],"comments_count":1,"level":5,"url":"item?id=16497629"}],"comments_count":2,"level":4,"url":"item?id=16497260"}],"comments_count":4,"level":3,"url":"item?id=16495576"},{"id":16494955,"user":"minimaxir","time":1519930524,"time_ago":"8 months ago","type":"comment","content":"<p>Granted, Type II error and confusion matrices are covered in more basic statistical classes, and are indeed important for hypothesis testing.","comments":[{"id":16495158,"user":"maffydub","time":1519931712,"time_ago":"8 months ago","type":"comment","content":"<p>I think the point the parent might have been making is that many people (or maybe just me) know &quot;type II error&quot; by the far more self-explanatory name of &quot;false negative&quot;.","comments":[],"comments_count":0,"level":4,"url":"item?id=16495158"}],"comments_count":1,"level":3,"url":"item?id=16494955"}],"comments_count":7,"level":2,"url":"item?id=16494724"},{"id":16495664,"user":"blackrock","time":1519934682,"time_ago":"8 months ago","type":"comment","content":"<p>What&#x27;s a &quot;type two&quot; error?<p>I had to google it.  It&#x27;s a false negative.<p>A &quot;Type 1&quot; error, is a false positive.<p>Is this like how people overuse the term &quot;orthogonal&quot;?","comments":[{"id":16496247,"user":"gmac","time":1519937744,"time_ago":"8 months ago","type":"comment","content":"<p>&quot;Type I&quot; and &quot;Type II&quot; errors are some of the stupidest and most obfuscatory academic terminology ever invented, and (as an academic) I absolutely refuse to make the effort to learn which way round they go. Just call the bloody things what they are: false positives and false negatives. (Getting seriously OT now, but Kahneman does something annoyingly similar with his talk of &quot;System 1&quot; and &quot;System 2&quot; in Thinking Fast and Slow).","comments":[{"id":16496878,"user":"jerf","time":1519942305,"time_ago":"8 months ago","type":"comment","content":"<p>As a computer scientist&#x2F;programmer, there are three numbers, 0, 1, and infinity. If you&#x27;re going to index your errors by the natural numbers, and you&#x27;ve got Type 1 Errors and Type 2 Errors, my next question is what a Type 3 Error is, and you know what my next question after that is.<p>Otherwise, please take this wisdom from programmers, who deal with this sort of thing all the time, and use an enumeration, in this case, {False Positive, False Negative} will do just fine.","comments":[],"comments_count":0,"level":4,"url":"item?id=16496878"},{"id":16500415,"user":"derivt","time":1519986760,"time_ago":"8 months ago","type":"comment","content":"<p>When you are designing an hypothesis test the term positive and negative are not so clear. For example you can test that mean weight of bags is  greater than 5.0 kg or smaller than 5.0 kg, both test are different, and some times you can accept both greater and smaller than 5.0 kg.   The philosophy of hypotesis test is not as clear as a  standard tests for pregnancy. In other terms,in some cases  the H0 hypothesis is symmetric (&gt;= versus =&lt;)  and is not clear what a positive result should be, you have to state clearly what is the H0 hypothesis. In a pregnancy test everyone agree than H0 is that you are not pregnant, that is in my HO the semantic difference between Type 1 error and false negative.","comments":[],"comments_count":0,"level":4,"url":"item?id=16500415"},{"id":16497000,"user":"fibores","time":1519943371,"time_ago":"8 months ago","type":"comment","content":"<p>What are some synonyms to Kahneman&#x27;s System 1 and System 2 then? Because Type 1 and 2 errors seem to be completely equivalent to false and positive negatives. I think Kahneman motivates his decision to introduce the terms System 1 and 2  quite well in his book, and I don&#x27;t know of any direct counterparts.","comments":[{"id":16497441,"user":"shard","time":1519947606,"time_ago":"8 months ago","type":"comment","content":"<p>Jonathan Haidt proposed a similar system in his book &quot;The Happiness Hypothesis&quot;. He called it the automatic and controlled sides. The automatic side&#x2F;system 1 is also what&#x27;s being described in the book &quot;The Inner Game of Tennis&quot;. I would summarize the two sides as the reflexive and the deliberate sides.","comments":[],"comments_count":0,"level":5,"url":"item?id=16497441"},{"id":16497996,"user":"Tarq0n","time":1519952943,"time_ago":"8 months ago","type":"comment","content":"<p>If the title of his book is justified, maybe the fast and slow systems?","comments":[],"comments_count":0,"level":5,"url":"item?id=16497996"}],"comments_count":2,"level":4,"url":"item?id=16497000"},{"id":16498641,"user":"nmca","time":1519960042,"time_ago":"8 months ago","type":"comment","content":"<p>Ahaha, I agree so much the the Kahneman jibe. How could someone so smart pick names so f*cking dumb?!","comments":[],"comments_count":0,"level":4,"url":"item?id=16498641"}],"comments_count":6,"level":3,"url":"item?id=16496247"},{"id":16495768,"user":"blackrock","time":1519935195,"time_ago":"8 months ago","type":"comment","content":"<p>So, to put this in human terms.<p>A false positive or false negative, can be like a pregnancy test.<p>A false positive, can be where the pregnancy test shows your wife is pregnant, but she is not.  And the baby never arrives.  Phew, dodged a bullet!<p>A false negative, can be where the pregnancy test shows your wife is not pregnant, but she really is.  And 9 months later, a baby accidentally pops out.  Oh crap!","comments":[{"id":16496531,"user":"joshuamorton","time":1519939719,"time_ago":"8 months ago","type":"comment","content":"<p>Of course false-positives can also be bad. To use your example &quot;you then spend $10,000 prepping for the baby, but it never comes, what a waste!&quot;","comments":[],"comments_count":0,"level":4,"url":"item?id=16496531"}],"comments_count":1,"level":3,"url":"item?id=16495768"}],"comments_count":9,"level":2,"url":"item?id=16495664"},{"id":16497030,"user":"bitL","time":1519943669,"time_ago":"8 months ago","type":"comment","content":"<p>&gt; Jaccard indexes<p>Funny you mention Jaccard; I was looking up if IoU (Intersection over Union) has any other name known to ML people when I was preparing my self-driving car presentation (IoU is used in semantic segmentation), and found out it is called Jaccard index as well. To my surprise, all ML experts I know knew about IoU but nobody about Jaccard. I guess it might depend on which university you attended?","comments":[{"id":16497181,"user":"aoki","time":1519945001,"time_ago":"8 months ago","type":"comment","content":"<p>i think the term is more prominent on the NLP side, via information retrieval (IR) and clustering.  i first saw it in IR, and you&#x27;d see it in stanford&#x27;s CS 124 or CS 224N, for example. if the parent is talking about people who are working on a system that has text-understanding component, i can understand their surprise.","comments":[],"comments_count":0,"level":3,"url":"item?id=16497181"}],"comments_count":1,"level":2,"url":"item?id=16497030"},{"id":16495022,"user":"maffydub","time":1519930867,"time_ago":"8 months ago","type":"comment","content":"<p>For anyone else who wondered what the Jaccard index is, it&#x27;s also referred to as Intersection over Union.<p>...and if you haven&#x27;t come across that either, see <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Jaccard_index\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Jaccard_index</a> for details.","comments":[{"id":16495162,"time":1519931727,"time_ago":"8 months ago","type":"comment","content":"[deleted]","deleted":true,"comments":[],"comments_count":0,"level":3,"url":"item?id=16495162"}],"comments_count":1,"level":2,"url":"item?id=16495022"},{"id":16498616,"user":"nilkn","time":1519959811,"time_ago":"8 months ago","type":"comment","content":"<p>Was the project the person was working on having any success? If so, you might be unfairly ignoring their positive contributions and focusing only on this one negative sign that you observed.","comments":[],"comments_count":0,"level":2,"url":"item?id=16498616"},{"id":16522076,"user":"sacado2","time":1520267060,"time_ago":"8 months ago","type":"comment","content":"<p>My ML model is 99.7% sure you&#x27;re a gatekeeper. Might be a type 1 error, though.","comments":[],"comments_count":0,"level":2,"url":"item?id=16522076"},{"id":16494668,"user":"fwdpropaganda","time":1519928957,"time_ago":"8 months ago","type":"comment","content":"<p>What&#x27;s topic drift?","comments":[{"id":16495294,"user":"stochastic_monk","time":1519932513,"time_ago":"8 months ago","type":"comment","content":"<p>It seems to be a specialized term referring to the change in focus of blogs [0] and online communities [1] over time. This strikes me as a very specialized concept, rather than a generally-important term in machine learning as a whole.<p>Edit: To add my perspective, with years of industry experience and graduate-level machine learning coursework, I have never before encountered this term.<p>[0]: <a href=\"https:&#x2F;&#x2F;link.springer.com&#x2F;chapter&#x2F;10.1007&#x2F;978-3-319-16354-3_52\" rel=\"nofollow\">https:&#x2F;&#x2F;link.springer.com&#x2F;chapter&#x2F;10.1007&#x2F;978-3-319-16354-3_...</a><p>[1]: <a href=\"http:&#x2F;&#x2F;catb.org&#x2F;jargon&#x2F;html&#x2F;T&#x2F;topic-drift.html\" rel=\"nofollow\">http:&#x2F;&#x2F;catb.org&#x2F;jargon&#x2F;html&#x2F;T&#x2F;topic-drift.html</a>","comments":[{"id":16508639,"user":"epsilon_machine","time":1520071056,"time_ago":"8 months ago","type":"comment","content":"<p>Also seems closely related to the concept of stationarity in time series analysis [<a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Stationary_process\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Stationary_process</a>]","comments":[],"comments_count":0,"level":4,"url":"item?id=16508639"}],"comments_count":1,"level":3,"url":"item?id=16495294"},{"id":16496665,"user":"ju-st","time":1519940591,"time_ago":"8 months ago","type":"comment","content":"<p>maybe he meant concept drift? <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Concept_drift\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Concept_drift</a>","comments":[{"id":16500203,"user":"3pt14159","time":1519983259,"time_ago":"8 months ago","type":"comment","content":"<p>I did, yes.","comments":[],"comments_count":0,"level":4,"url":"item?id=16500203"}],"comments_count":1,"level":3,"url":"item?id=16496665"}],"comments_count":4,"level":2,"url":"item?id=16494668"}],"comments_count":34,"level":1,"url":"item?id=16494430"},{"id":16495371,"user":"cowmoo728","time":1519932914,"time_ago":"8 months ago","type":"comment","content":"<p>We have to separate AI researcher and implementation engineer. These types of crash courses help get you to the point where you can reasonably work under PhD level people and write code to test, scale, and deploy their ideas.<p>For many current applications of ML this is acceptable because you&#x27;re just stealing an idea from a paper or stealing ImageNet to recognize your problem. For anything else you really need to pay up and fight with Google for a real expert.","comments":[{"id":16496541,"user":"akmiller","time":1519939773,"time_ago":"8 months ago","type":"comment","content":"<p>Exactly. Somewhat akin to graphics programming. There are much smaller groups that work on actually building 3D graphics engines, however, many developers take those engines and use them to build successful applications and games.","comments":[{"id":16508962,"user":"stealthcat","time":1520079525,"time_ago":"8 months ago","type":"comment","content":"<p>So we need to wait for Unity of ML? With Asset Store selling models and datasets.","comments":[],"comments_count":0,"level":3,"url":"item?id=16508962"}],"comments_count":1,"level":2,"url":"item?id=16496541"},{"id":16496560,"user":"maxxxxx","time":1519939888,"time_ago":"8 months ago","type":"comment","content":"<p>Will we reach a state where ML is as accessible for implementers as SQL databases? I still remember the time when databases were only for experts.","comments":[{"id":16504577,"user":"infinite8s","time":1520016997,"time_ago":"8 months ago","type":"comment","content":"<p>Yes hopefully. Take a look at BayesDB (and the underlying crosscat algorithm) and probabilistic programming.","comments":[],"comments_count":0,"level":3,"url":"item?id=16504577"}],"comments_count":1,"level":2,"url":"item?id=16496560"},{"id":16499247,"user":"deviationblue","time":1519967943,"time_ago":"8 months ago","type":"comment","content":"<p>&gt;you can reasonably work under PhD level people and write code to test, scale, and deploy their ideas.<p>Which phd, though? All PhDs are not equal (see politics vs computer vision). Also, PhDs are hardly the holy grail of demonstrating capability, accuracy or intellect, especially given the reproducibility crisis, phds as a measure of any of those things should be used carefully.","comments":[{"id":16500063,"user":"jebediah","time":1519981063,"time_ago":"8 months ago","type":"comment","content":"<p>They are talking about PhDs in Machine Learning of course","comments":[],"comments_count":0,"level":3,"url":"item?id=16500063"}],"comments_count":1,"level":2,"url":"item?id=16499247"},{"id":16497655,"user":"aje403","time":1519949780,"time_ago":"8 months ago","type":"comment","content":"<p>They really don&#x27;t. There is a link to the Wikipedia page for matrix multiplication. If these are the people you want to hire, you might as well start outsourcing or generating random numbers","comments":[],"comments_count":0,"level":2,"url":"item?id=16497655"}],"comments_count":7,"level":1,"url":"item?id=16495371"},{"id":16494548,"user":"foobiekr","time":1519928102,"time_ago":"8 months ago","type":"comment","content":"<p>Gate keeping is only obsolete when it ceases to have impact. The reality right now is that ML is extremely hard to enter even for a very knowledgeable and deeply experienced but non-credentialed (by degree) person.<p>It will be interesting to see how the situation evolves but my own observations are that people trying to enter the space might be better off getting a quickie masters if they can afford the time or cost than to try and bootstrap it.","comments":[{"id":16494755,"user":"eanzenberg","time":1519929414,"time_ago":"8 months ago","type":"comment","content":"<p>Even people getting a quickie masters is hit&#x2F;miss in my experience. At the end of the day, successful machine learning engineers require a whole suit of different skills, both technical, communicative, and even life skills that don&#x27;t really exist for software devs. Not all those can be taught in 3 months, 2 years or even 6 years.","comments":[{"id":16495690,"user":"achompas","time":1519934824,"time_ago":"8 months ago","type":"comment","content":"<p>&gt; both technical, communicative, and even life skills that don&#x27;t really exist for software devs<p>Not a fan of this &quot;data scientist is a unicorn&quot; style of thinking. The best people in any profession (especially software engineering) also use these skills in their day-to-day work.","comments":[{"id":16498027,"user":"xapata","time":1519953210,"time_ago":"8 months ago","type":"comment","content":"<p>Data science isn&#x27;t yet as stratified as software engineering, so there&#x27;s less room for those without those &quot;unicorn&quot; skills. 10 years ago, there was no room at all. 10 years from now, there will probably be plenty of undergrads hired as junior data scientists.","comments":[],"comments_count":0,"level":4,"url":"item?id=16498027"}],"comments_count":1,"level":3,"url":"item?id=16495690"},{"id":16495540,"user":"ariwilson","time":1519933916,"time_ago":"8 months ago","type":"comment","content":"<p>Life skills? Communicative skills? What?","comments":[{"id":16495674,"user":"eanzenberg","time":1519934739,"time_ago":"8 months ago","type":"comment","content":"<p>IMO essentially ML experts don&#x27;t work in a bubble and may interface with potentially anyone at a company; C-level, engineering, product, marketing, ops, etc etc. What other tech-employee needs that flexibility? So, I grouped communication &#x2F; life skills into being able to understand, read, interpret and ultimately provide value to potentially any team. Just having the technical skills will only get you so far.","comments":[{"id":16496160,"user":"stevbov","time":1519937258,"time_ago":"8 months ago","type":"comment","content":"<p>Isn&#x27;t this part of what most software engineering degrees teach though?  Particularly surrounding project planning and requirements gathering?","comments":[],"comments_count":0,"level":5,"url":"item?id=16496160"},{"id":16497152,"user":"kevincennis","time":1519944701,"time_ago":"8 months ago","type":"comment","content":"<p>I might be an outlier, but I interface with all of those on a daily basis in my role as a software engineer","comments":[],"comments_count":0,"level":5,"url":"item?id=16497152"},{"id":16496138,"user":"ariwilson","time":1519937171,"time_ago":"8 months ago","type":"comment","content":"<p>IMO software engineering experts (leaders) need to do the same thing.","comments":[],"comments_count":0,"level":5,"url":"item?id=16496138"}],"comments_count":3,"level":4,"url":"item?id=16495674"}],"comments_count":4,"level":3,"url":"item?id=16495540"}],"comments_count":7,"level":2,"url":"item?id=16494755"},{"id":16495237,"user":"canyon289","time":1519932153,"time_ago":"8 months ago","type":"comment","content":"<p>I agree with this comment. My experience has been that people don&#x27;t really look at your resume unless you have machine learning experience on your resume or one of the stats type majors","comments":[],"comments_count":0,"level":2,"url":"item?id=16495237"},{"id":16497300,"time":1519946081,"time_ago":"8 months ago","type":"comment","content":"[deleted]","deleted":true,"comments":[],"comments_count":0,"level":2,"url":"item?id=16497300"}],"comments_count":10,"level":1,"url":"item?id=16494548"},{"id":16494354,"user":"jorgemf","time":1519926861,"time_ago":"8 months ago","type":"comment","content":"<p>&gt; &quot;you can&#x27;t use AI&#x2F;ML unless you have a PhD&#x2F;5 years research experience&quot;<p>This is not true since a few years ago. But the fact that you can use it doesn&#x27;t mean you understand what is happening and why it works in development but not in production. Everybody can copy a jupyter notebook and train a TensorFlow model in ImageNet. Now go to a new domain with very few information like 3D models and create a new network to be trained in that dataset. How many people that can train ImageNet can do the latter? Even inside deep learning experts in image classification fail in reinforcement learning domains and need a couple of years to be completely productive.","comments":[],"comments_count":0,"level":1,"url":"item?id=16494354"},{"id":16495270,"user":"icc97","time":1519932384,"time_ago":"8 months ago","type":"comment","content":"<p>I fully agree with you that after a MOOC you&#x27;ve barely scratched the surface and until you&#x27;re implementing them yourself then you&#x27;re not going to jump into a ML job.<p>However personally I view the rest of the opposite way round. Getting through a course on Deep Learning takes months [0]. Then reading through Keras code once you understand the appropriate NNs is easy.<p>For example it takes a while of going through Neural Networks to understand ResNets. But if you understand ResNets then looking though Keras code that creates a ResNet [1] is easy.<p>If I want to build a NN of any sort in Keras I can just Google for it. However there&#x27;s no simple Googling you can do to teach yourself NN in an easy to follow structured way.<p>[0]: <a href=\"https:&#x2F;&#x2F;www.deeplearning.ai&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.deeplearning.ai&#x2F;</a><p>[1]: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;Hyperparticle&#x2F;one-pixel-attack-keras&#x2F;blob&#x2F;master&#x2F;networks&#x2F;resnet.py\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;Hyperparticle&#x2F;one-pixel-attack-keras&#x2F;blob...</a>","comments":[{"id":16496956,"user":"p1esk","time":1519943056,"time_ago":"8 months ago","type":"comment","content":"<p>Understanding NNs is easy. Understanding, collecting, and cleaning up data is the hard part.<p>Also, DL != ML.<p>Paraphrasing &quot;The Tao of Network Protocols&quot;: If all you see is DL, you see nothing.","comments":[{"id":16498435,"user":"tonypace","time":1519957362,"time_ago":"8 months ago","type":"comment","content":"<p>There are a tremendous number of people outside of programming who spend much or all of their work time collecting, cleaning up, and understanding data. Think teachers, accountants, traders - essentially everyone who spends a lot of time in spreadsheets.","comments":[],"comments_count":0,"level":3,"url":"item?id=16498435"},{"id":16497182,"user":"icc97","time":1519945009,"time_ago":"8 months ago","type":"comment","content":"<p>The parent was referring to Keras which is a NN API hence why I responded talking about NN.","comments":[],"comments_count":0,"level":3,"url":"item?id=16497182"}],"comments_count":2,"level":2,"url":"item?id=16496956"}],"comments_count":3,"level":1,"url":"item?id=16495270"},{"id":16494336,"user":"ariwilson","time":1519926714,"time_ago":"8 months ago","type":"comment","content":"<p>Isn&#x27;t this meant to be an introduction? I&#x27;m not sure who comes out of a crash course assuming they&#x27;re an expert.","comments":[],"comments_count":0,"level":1,"url":"item?id=16494336"},{"id":16499773,"user":"balls187","time":1519975785,"time_ago":"8 months ago","type":"comment","content":"<p>&gt;  taking and passing a crash course doesn&#x27;t mean you&#x27;ll be an expert in the field (and this applies for most MOOCs, honestly)<p>You&#x27;re stating the painfully obvious here. I doubt anyone reading HN is under the impression that they&#x27;ll be an expert after a single online course.<p>This is just a marketing stunt by Google to ensure their tooling is the defacto standard for AI&#x2F;ML so that Google can dominate the AI&#x2F;ML market they way they dominated Internet Search.","comments":[],"comments_count":0,"level":1,"url":"item?id=16499773"},{"id":16498914,"user":"taneq","time":1519963602,"time_ago":"8 months ago","type":"comment","content":"<p>&gt; taking and passing a crash course doesn&#x27;t mean you&#x27;ll be an expert in the field (and this applies for most MOOCs, honestly)<p>Any field that you can become an expert in with a 6-week course or less is not a field that should be paying even high 5-figure salaries. Or, conversely, any field which pays 6-figure salaries is either not accessible via an MOOC, or is massively overinflated and probably in a bubble.","comments":[{"id":16498984,"time":1519964480,"time_ago":"8 months ago","type":"comment","content":"[deleted]","deleted":true,"comments":[],"comments_count":0,"level":2,"url":"item?id=16498984"}],"comments_count":1,"level":1,"url":"item?id=16498914"},{"id":16498145,"user":"Puer","time":1519954507,"time_ago":"8 months ago","type":"comment","content":"<p>The real barrier to entry to ML is statistics. Most computer science degrees require an intro to statistics class, but if you really want to understand ML and where it should and can be applied appropriately you need a much deeper understanding.<p>IMO, it&#x27;s much easier to pick up the programming required for ML than the statistics. This was reflected in the classes I took as a double statistics&#x2F;computer science major. Most of the people in my CS department&#x27;s machine learning course were statistics students looking to go into data science, not computer programmers looking to get in on the ML trend.","comments":[],"comments_count":0,"level":1,"url":"item?id=16498145"},{"id":16497088,"user":"ssivark","time":1519944110,"time_ago":"8 months ago","type":"comment","content":"<p>&gt; Yes, AI&#x2F;ML MOOCs teach the corresponding tools well, and the creation of new tools like Keras make the field much more accessible. The obsolete gatekeeping by the AI&#x2F;ML elites who say &quot;you can&#x27;t use AI&#x2F;ML unless you have a PhD&#x2F;5 years research experience&quot; is one of the things I really hate about the industry.<p>The problem is that having a hammer makes one see everything as a nail. Sure, given a suitably clean set of images, anyone who&#x27;s done a couple of tutorials will be able to apply a pre-trained neural on them to get <i>something</i>.<p>The hard part is getting an understanding of what tweaks to use when, and when to give up on a method. Otherwise, it is very easy to get carried away and waste time&#x2F;resources.<p>For that, one needs to develop a good understanding of the landscape of ML algorithms, why each of them works and how they could break. That typically takes (intensive) experience or an understanding of the theory. Otherwise you&#x27;ll be doing a brute-force search through a list of possible algorithms. As they say, <i>&quot;a few days in the lab might save a few hours in the library...&quot;</i><p>Yes, things can get painful during hiring because the process is broken as it is, with additional complications due to not knowing how to vet for quality in a nascent field. But the &quot;ML elite&quot; are not morons and they don&#x27;t mean to be obnoxious gatekeepers.","comments":[],"comments_count":0,"level":1,"url":"item?id=16497088"},{"id":16494374,"user":"acconrad","time":1519926962,"time_ago":"8 months ago","type":"comment","content":"<p>&gt; <i>The obsolete gatekeeping by the AI&#x2F;ML elites who say &quot;you can&#x27;t use AI&#x2F;ML unless you have a PhD&#x2F;5 years research experience&quot; is one of the things I really hate about the industry.</i><p>So what are they hoping to achieve with this course? I&#x27;m genuinely asking because part of me wants to take the course, but another part of me feels like what&#x27;s the point if, even through many additional courses to build up a skill set, Google wouldn&#x27;t hire you as an ML engineer unless you basically start your career back to a junior engineer but in machine learning at another company.","comments":[{"id":16494685,"user":"solarkraft","time":1519929083,"time_ago":"8 months ago","type":"comment","content":"<p>I have a feeling that they&#x27;re trying to get people familiar with TensorFlow and thus very compatible with their cloud computing services.","comments":[{"id":16494819,"user":"eanzenberg","time":1519929771,"time_ago":"8 months ago","type":"comment","content":"<p>I dunno.. for this level of ml scikit&#x2F;numpy is way more accessible than tensorflow.","comments":[],"comments_count":0,"level":3,"url":"item?id=16494819"}],"comments_count":1,"level":2,"url":"item?id=16494685"},{"id":16500218,"user":"mdda","time":1519983426,"time_ago":"8 months ago","type":"comment","content":"<p>Look at it from an interview perspective.  If I ask &quot;are you interested in exploring ML&quot;, and you&#x27;re enthusiastic, my next questions are : What have you done?  Have you taken any courses?  GitHub?  Blog Posts?<p>If the answer is that you&#x27;re waiting for a special sign that it&#x27;s worth doing before making an effort, then that really tells me that your enthusiasm for doing ML is not reality-based.  Doing the ML thing is a pretty different mindset from other software jobs.","comments":[],"comments_count":0,"level":2,"url":"item?id=16500218"},{"id":16494423,"user":"pilooch","time":1519927274,"time_ago":"8 months ago","type":"comment","content":"<p>No but you&#x27;ll ready yourself for the (geometric) programming of the next twenty years or so.","comments":[],"comments_count":0,"level":2,"url":"item?id=16494423"}],"comments_count":4,"level":1,"url":"item?id=16494374"},{"id":16495735,"user":"xamuel","time":1519935061,"time_ago":"8 months ago","type":"comment","content":"<p>The other day I met with someone who was visiting my city to attend a big ML conference.  In the course of our discussion, it transpired this person did not know the Halting Problem.  He&#x27;d &quot;heard of&quot; Turing machines, but nothing more than &quot;hearing&quot; of them.<p>Gatekeepers shouldn&#x27;t keep gates just for gatekeeping sake. But if so-called ML experts don&#x27;t even know undergraduate computer science, that should really give you pause before you open up your wallet for them.","comments":[{"id":16497017,"user":"eanzenberg","time":1519943544,"time_ago":"8 months ago","type":"comment","content":"<p>I could have the same reverse worldview:<p>&quot;I attended a big software dev conference. Someone I met did not know about data bias. They heard of gradient boosting but nothing more than hearing them. If so-called dev experts don&#x27;t even know undergraduate statistics, that should really give you pause before you open up your wallet for them.&quot;","comments":[],"comments_count":0,"level":2,"url":"item?id=16497017"},{"id":16496679,"user":"HumanDrivenDev","time":1519940768,"time_ago":"8 months ago","type":"comment","content":"<p>Maybe I&#x27;m an iconoclast, but I&#x27;d respect that person more for not trying to bullshit his way out of it.","comments":[{"id":16497892,"user":"xamuel","time":1519951992,"time_ago":"8 months ago","type":"comment","content":"<p>That&#x27;s a great point. It shines a positive light on the gentleman I spoke with, and a negative light on the industry as a whole (if bs is so rampant that merely admitting not knowing something makes someone shine)","comments":[],"comments_count":0,"level":3,"url":"item?id=16497892"}],"comments_count":1,"level":2,"url":"item?id=16496679"},{"id":16495811,"user":"eanzenberg","time":1519935454,"time_ago":"8 months ago","type":"comment","content":"<p>Why? Most of that cruft is abstracted away, computation only gets cheaper over time (a world class AI rig cost ~30k, a decent one for 2k) and most applications of ML run on commodity hardware.","comments":[{"id":16495889,"user":"xamuel","time":1519935908,"time_ago":"8 months ago","type":"comment","content":"<p>For one thing, it suggests that they are actually technicians, not the scientists they&#x27;re selling themselves as.<p>That&#x27;s fine if you want a technician (and if they&#x27;re charging technician&#x27;s rates).","comments":[{"id":16500972,"user":"opencl","time":1519994611,"time_ago":"8 months ago","type":"comment","content":"<p>I think when it comes to ML the CS experts with limited statistics knowledge are the technicians and the statistics experts with limited CS knowledge are the scientists, not the other way around.","comments":[],"comments_count":0,"level":4,"url":"item?id=16500972"},{"id":16496982,"user":"eanzenberg","time":1519943267,"time_ago":"8 months ago","type":"comment","content":"<p>And then that technician rate is X times what a technician rate would be for pure software dev.. what is your point?","comments":[],"comments_count":0,"level":4,"url":"item?id=16496982"}],"comments_count":2,"level":3,"url":"item?id=16495889"}],"comments_count":3,"level":2,"url":"item?id=16495811"},{"id":16496545,"user":"joshuamorton","time":1519939801,"time_ago":"8 months ago","type":"comment","content":"<p>Why does an ML-expert need to know the halting problem?<p>Considering that ML is really a CS-oriented form of statistics, why would you expect a statistician to know CS theory?","comments":[{"id":16496647,"user":"xamuel","time":1519940491,"time_ago":"8 months ago","type":"comment","content":"<p>Thinking more, it&#x27;s the misleading names (&quot;machine learning&quot;, &quot;AI&quot;) that rustle my jimmies so much.<p>Sure, you don&#x27;t need to know the halting problem to approximately solve MNIST by fitting a million-parameter curve to a dataset.<p>But you&#x27;re misleading people if you&#x27;re claiming to have any kind of insight into how computers can be made intelligent, or how computers can &quot;learn&quot;, when you don&#x27;t even know the halting problem.","comments":[{"id":16501108,"user":"dannypgh","time":1519996399,"time_ago":"8 months ago","type":"comment","content":"<p>I disagree. Frankly, for a lot of people and a lot of contexts, I don&#x27;t think the halting problem is particularly important. You&#x27;re using understanding of it as a shibboleth for exposure to common curricula about theoretical computation. But you can even know a lot about practical computation and not know anything about the halting problem. Curious: has your knowledge of the halting problem ever actually saved you time or effort in your work? If so, how?<p>Turing&#x27;s work on the limitations of his machine are interesting, and I&#x27;m sure people with a deep understanding of them can advance the study of computation.<p>I think you&#x27;re just being dismissive of skillsets which aren&#x27;t your own. I think you&#x27;re just bothered by the fact that AI and ML are being advanced more by people with more knowledge of linear algebra and statistics than computer science. And realize that it&#x27;s the arrogant among them that will dismiss you as &quot;just a technician.&quot;<p>Anyone who is looking down on either &quot;scientists&quot; or &quot;technicians&quot; should get over themselves.","comments":[{"id":16522358,"user":"sacado2","time":1520268861,"time_ago":"8 months ago","type":"comment","content":"<p>&gt; Curious: has your knowledge of the halting problem ever actually saved you time or effort in your work? If so, how?<p>Not OP, but I&#x27;m working a lot with ontologies. Some ontologies representations are undecidable, while other languages are not very expressive but can be manipulated in polynomial time. Had I not known that, I would still be like &quot;crap, why does it take so long? I must have a bug somewhere, maybe I should switch to C&quot;.<p>&gt;  AI and ML are being advanced more by people with more knowledge of linear algebra and statistics than computer science.<p>Just answered OP about that, but actually, symbolic AI is pure computer science. It does not get as much publicity as ML currently, but believe me, it&#x27;s everywhere: at the core of almost all package managers, like debian&#x27;s apt-get or maven, at the core of most advanced static code analyzers, etc.","comments":[],"comments_count":0,"level":5,"url":"item?id=16522358"}],"comments_count":1,"level":4,"url":"item?id=16501108"},{"id":16498070,"user":"xapata","time":1519953699,"time_ago":"8 months ago","type":"comment","content":"<p>I guess &quot;dynamic programming&quot; must really bother you. That field was named completely arbitrarily, to secure funding.<p>The more you look around, the more you find science concepts are named for marketing purposes.<p>Heck, &quot;data scientist&quot; is a bit of nonsense.","comments":[],"comments_count":0,"level":4,"url":"item?id=16498070"},{"id":16522241,"user":"sacado2","time":1520268072,"time_ago":"8 months ago","type":"comment","content":"<p>This is a recent shift lead by the ML trend. Traditionally (like 5 years ago), ML and AI were two different things, AI being the term for symbol manipulation. Expert systems, inference engines, constraint programming, SAT solving for instance. These domains are typical CS stuff: inference, complexity classes, low-level representation of data, etc. You don&#x27;t need that much knowledge in math&#x2F;statistics to be proficient in those fields, but you rather know what the halting problem is.<p>I&#x27;m working in the symbolic AI field, and sometimes use ML techniques. They are complementary. To me, ML is about induction, AI is abut deduction. They don&#x27;t solve the same kinds of problems and they tend to work pretty well together.","comments":[],"comments_count":0,"level":4,"url":"item?id=16522241"},{"id":16497157,"user":"joshuamorton","time":1519944782,"time_ago":"8 months ago","type":"comment","content":"<p>Does this just come down to a semantic idea that if something isn&#x27;t in pursuit of AGI, its not really AI? That feels unfair to most of these researchers who absolutely disagree with that.<p>And to consider these algorithms to not &quot;learn&quot; is similarly unfair. They do. They learn to solve specific problems (at least right now), but they do learn.","comments":[],"comments_count":0,"level":4,"url":"item?id=16497157"}],"comments_count":5,"level":3,"url":"item?id=16496647"},{"id":16498081,"user":"aoki","time":1519953782,"time_ago":"8 months ago","type":"comment","content":"<p>would you not expect your hypothesized (theoretical) ML expert to understand boosting, which is generally explained in terms of PAC learning, which draws on computational complexity?<p>that said, i&#x27;d also expect a phd in statistics to be able to figure out boosting without taking an undergrad course that worked up from automata. so the halting problem test, while it does capture something, may not be quite right.","comments":[],"comments_count":0,"level":3,"url":"item?id=16498081"}],"comments_count":7,"level":2,"url":"item?id=16496545"},{"id":16496593,"user":"sannee","time":1519940132,"time_ago":"8 months ago","type":"comment","content":"<p>&gt; But if so-called ML experts don&#x27;t even know undergraduate computer science<p>To be fair, Machine learning seems more closely related to applied mathematics - statistics&#x2F;optimization than to computer science.","comments":[],"comments_count":0,"level":2,"url":"item?id=16496593"},{"id":16496989,"user":"istorical","time":1519943289,"time_ago":"8 months ago","type":"comment","content":"<p>How does knowing that it&#x27;s impossible to predict whether an infinite loop exists in a piece of code yield an actionable piece of wisdom that this ML expert should have?<p>I&#x27;d suppose that most developers, formal education or not, would have encountered an infinite loop at some point in their initial work with iteration or recursion.<p>How does knowing that Turing proved you can&#x27;t predict this bug in a piece of code change anything?<p>I might genuinely be missing something important here - not trying to be snarky in my questioning.<p>It seems like obviously infinite loops are a disastrous bug for critical code - but what does knowing the formal name of the problem and background of its discovery give you?<p>I could understand if you were arguing in favor of test code or static analysis.","comments":[{"id":16497607,"time":1519949207,"time_ago":"8 months ago","type":"comment","content":"[deleted]","deleted":true,"comments":[],"comments_count":0,"level":3,"url":"item?id=16497607"}],"comments_count":1,"level":2,"url":"item?id=16496989"},{"id":16495875,"user":"grad_ml","time":1519935815,"time_ago":"8 months ago","type":"comment","content":"<p>&quot;turing machines&quot; are cs 101?","comments":[{"id":16495917,"user":"xamuel","time":1519936075,"time_ago":"8 months ago","type":"comment","content":"<p>Amended that to &quot;undergraduate computer science&quot;","comments":[],"comments_count":0,"level":3,"url":"item?id=16495917"}],"comments_count":1,"level":2,"url":"item?id=16495875"}],"comments_count":20,"level":1,"url":"item?id=16495735"},{"id":16500343,"user":"andreagrandi","time":1519985445,"time_ago":"8 months ago","type":"comment","content":"<p>&gt; The obsolete gatekeeping by the AI&#x2F;ML elites who say &quot;you can&#x27;t use AI&#x2F;ML unless you have a PhD&#x2F;5 years research experience&quot; is one of the things I really hate about the industry.<p>It&#x27;s the main reason why I decided to present a talk at the next PyCon Italy, as a very junior data scientist, to inspire other Python developers to learn some practical machine learning. If I could do it (and use it for a work project already) many other people can do (and no, I don&#x27;t even have a degree in CS, just years of work experience)","comments":[],"comments_count":0,"level":1,"url":"item?id=16500343"},{"id":16500623,"user":"YeGoblynQueenne","time":1519989715,"time_ago":"8 months ago","type":"comment","content":"<p>&gt;&gt; The obsolete gatekeeping by the AI&#x2F;ML elites who say &quot;you can&#x27;t use AI&#x2F;ML unless you have a PhD&#x2F;5 years research experience&quot; is one of the things I really hate about the industry.<p>I&#x27;m going to have to ask who exactly are those AI&#x2F;ML elites who say &quot;you can&#x27;t use AI&#x2F;ML unless you have a PhD&#x2F;5 years research experience&quot;.","comments":[],"comments_count":0,"level":1,"url":"item?id=16500623"},{"id":16495451,"user":"Florin_Andrei","time":1519933449,"time_ago":"8 months ago","type":"comment","content":"<p>TLDR: Taking a class is fine, but nothing beats real-world practice.<p>Wonder where I&#x27;ve heard this one before. :)","comments":[],"comments_count":0,"level":1,"url":"item?id=16495451"}],"comments_count":119,"level":0,"url":"item?id=16494238"},{"id":16494265,"user":"kmax12","time":1519926323,"time_ago":"8 months ago","type":"comment","content":"<p>Great to see they have a nice introductory section to feature engineering! Feature engineering is often the most impactful thing you can do to improve quality of models and a place where I often see beginners (and experts for that matter) get stuck. Google walks through how to work with json files and categorical variables <a href=\"https:&#x2F;&#x2F;developers.google.com&#x2F;machine-learning&#x2F;crash-course&#x2F;representation&#x2F;feature-engineering\" rel=\"nofollow\">https:&#x2F;&#x2F;developers.google.com&#x2F;machine-learning&#x2F;crash-course&#x2F;...</a>.<p>If anyone is looking to get more indepth, I work on an open source python library for automated feature engineering called Featuretools <a href=\"https:&#x2F;&#x2F;github.com&#x2F;featuretools&#x2F;featuretools&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;featuretools&#x2F;featuretools&#x2F;</a>. It can help when your data is more complex such as when it comprised of multiple tables.<p>We have several demos you can run yourself to apply it to real datasets here: <a href=\"https:&#x2F;&#x2F;www.featuretools.com&#x2F;demos\" rel=\"nofollow\">https:&#x2F;&#x2F;www.featuretools.com&#x2F;demos</a>.","comments":[{"id":16495940,"user":"fnl","time":1519936201,"time_ago":"8 months ago","type":"comment","content":"<p>Your comment got me interested in this course. However, all I could find about feature engineering there is what you linked to, directly.<p>Given that entire scientific careers, books, and conferences are built around the topic of feature engineering, and at least IMO good ML tools live or die with good feature engineering (in its broadest sense, for you deep learning fanatics :-)) that doesn&#x27;t seem like more than the bare minimum I&#x27;d expect from <i>any</i> ML &quot;crash-course&quot; that is to be taken serious (and I wouldn&#x27;t expect an ounce less from Google... :-)).<p>Am I missing something, maybe?<p>In any case, nice work of your own, and thanks for sharing it!","comments":[{"id":16499015,"user":"kmax12","time":1519964882,"time_ago":"8 months ago","type":"comment","content":"<p>10 seconds into the video of feature engineering they say that feature engineering takes up about 75% of the time <a href=\"https:&#x2F;&#x2F;developers.google.com&#x2F;machine-learning&#x2F;crash-course&#x2F;representation&#x2F;video-lecture\" rel=\"nofollow\">https:&#x2F;&#x2F;developers.google.com&#x2F;machine-learning&#x2F;crash-course&#x2F;...</a><p>They understand the value, but but if you keep watching, they don’t seen go beyond the basic.","comments":[],"comments_count":0,"level":2,"url":"item?id=16499015"}],"comments_count":1,"level":1,"url":"item?id=16495940"},{"id":16494372,"user":"minimaxir","time":1519926939,"time_ago":"8 months ago","type":"comment","content":"<p>Although I&#x27;m normally skeptical of AI&#x2F;ML courses, that section on feature engineering do&#x27;s-and-do-nots is new and surprisingly under-discussed. It&#x27;s very useful even outside of AI&#x2F;ML.","comments":[{"id":16494416,"user":"kmax12","time":1519927228,"time_ago":"8 months ago","type":"comment","content":"<p>I agree.<p>I expect that as companies increase their focus on finding practical applications of ML &#x2F; AI, the topic will start to get more attention in these tutorials, as well as from researchers. Right now, too many people assume you already have a feature matrix, which is rarely the case when working on real world problems.","comments":[],"comments_count":0,"level":2,"url":"item?id=16494416"}],"comments_count":1,"level":1,"url":"item?id=16494372"},{"id":16494689,"user":"cjalmeida","time":1519929126,"time_ago":"8 months ago","type":"comment","content":"<p>OTOH, automating feature engineering is a thing. There are papers on using unsupervised methods to do that.<p>The 1st place in Kaggle&#x27;s Porto Seguro competition trained an Autoencoder on raw data to extract features.","comments":[],"comments_count":0,"level":1,"url":"item?id=16494689"},{"id":16498688,"user":"cuchoi","time":1519960526,"time_ago":"8 months ago","type":"comment","content":"<p>How do you select features created with featuretools? The problem with automated feature engineering is that you end with too many irrelevant features, and I haven&#x27;t found a good guide on feature selection.","comments":[],"comments_count":0,"level":1,"url":"item?id=16498688"}],"comments_count":6,"level":0,"url":"item?id=16494265"},{"id":16494014,"user":"eddieplan9","time":1519925028,"time_ago":"8 months ago","type":"comment","content":"<p>For those interested in a deeper dive to just deep learning, &quot;Tensorflow and deep learning - without a PhD&quot; is really good, and covers a lot of material in a single 2hr talk.<p><a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=vq2nnJ4g6N0\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=vq2nnJ4g6N0</a>","comments":[{"id":16497658,"user":"null0pointer","time":1519949801,"time_ago":"8 months ago","type":"comment","content":"<p>+1 for this. Well worth the 2 hours.","comments":[],"comments_count":0,"level":1,"url":"item?id=16497658"},{"id":16510398,"user":"mlevental","time":1520098535,"time_ago":"8 months ago","type":"comment","content":"<p>the deep nets and conv nets stuff was excellent. i wish the explanation of rnns was a little better.","comments":[],"comments_count":0,"level":1,"url":"item?id=16510398"}],"comments_count":2,"level":0,"url":"item?id=16494014"},{"id":16495866,"user":"andyjohnson0","time":1519935769,"time_ago":"8 months ago","type":"comment","content":"<p>This looks like a well put-together course, and a good way to learn TensorFlow. Keras and TensorFlow are top of my list of technologies to explore in the very near future.<p>Is anyone here doing Andrew Ng&#x27;s Machine Learning course [1]? I&#x27;m about half-way through and really enjoying it. I&#x27;m particularly appreciating that the programming exercises are done in MatLab&#x2F;Octave, so I feel that I&#x27;m really understanding the fundamentals without an API getting in the way, and developing some good intuition. Obviously frameworks are the way to go for production ML work, but I wonder whether ML people here think this bottom-up approach is advisable or could it be misleading when I move on to Keras&#x2F;TensorFlow&#x2F;whatever?<p>[1] <a href=\"https:&#x2F;&#x2F;www.coursera.org&#x2F;learn&#x2F;machine-learning\" rel=\"nofollow\">https:&#x2F;&#x2F;www.coursera.org&#x2F;learn&#x2F;machine-learning</a><p>Edit: brevity","comments":[{"id":16495982,"user":"bkanber","time":1519936347,"time_ago":"8 months ago","type":"comment","content":"<p>I teach ML and am currently writing my 2nd book on it.<p>I always advocate learning the fundamentals. Machine learning <i>is</i> math, and neural networks in particular rely on linear algebra and vector calculus. (You can build a NN without using linear algebra directly, likely it&#x27;ll be slower and besides, the concept still relies on linear algebra).<p>Frameworks abstract away a lot of the mathiness, which is a net good for society (ie, exposing lots of developers to neural networks), but I consider that a net-negative for the individual developer.<p>When working on anything but trivial toy problems, you should make sure you understand your problem domain and implementation thoroughly. Is the activation function you&#x27;ve chosen ideal for your problem domain? If not, choose a better one. If no better one exists, you can invent it; but you&#x27;ll also need to know how to design the backpropagation algorithm for that new activation function (which requires some vector calculus).<p>Learning the math, as you have, helps you tune your algorithm based on actual knowledge rather than guesswork. I don&#x27;t think it will be misleading when you move on to a framework. The frameworks are built on the same math.<p>That said -- if all you&#x27;re looking to do is play around, then you don&#x27;t need the math as much.","comments":[{"id":16497317,"user":"andyjohnson0","time":1519946273,"time_ago":"8 months ago","type":"comment","content":"<p>Thanks for taking the time to write such a comprehensive reply - much appreciated. &quot;ML is maths&quot; is something that I&#x27;m getting used to now. I do have some real uses in mind for what I&#x27;m learning&#x27; both in my job and some side projects, particularly image feature recognition, and I&#x27;m looking forward so seeing how it all works in out. Thanks again!","comments":[{"id":16499047,"user":"bkanber","time":1519965227,"time_ago":"8 months ago","type":"comment","content":"<p>Image feature recognition is <i>not quite</i> solved but I feel it&#x27;s very close. It&#x27;s easier, obviously, if the problem domain is very specific.<p>In the past, like when I started on ML, the best tip was to make sure to do some edge detection with a few convolutions before feeding an image to a neural network. Now, we have convolutional neural networks that kinda do that for you automatically.<p>Sometime in between those two dates, someone figured out how to get the convolutions trained via backpropagation -- and they did that by deriving the gradient of an arbitrary convolution (or more likely, looking it up). And that let us put convolutions right in the neural net and have the convolutions automatically train themselves along with the rest of the network. And we observe that the convolutions do things that we would do, like remove unnecessary detail and highlight edges or exaggerate colors.<p>Anyways; I believe the current state-of-the-art for generic image feature recognition is an ensemble of convolutional neural networks. I believe Google leads the pack on the commercial side so maybe look into how they do it.","comments":[{"id":16504423,"user":"p1esk","time":1520016039,"time_ago":"8 months ago","type":"comment","content":"<p><i>not quite solved</i> is the right way to put it.<p>If you look at capsules papers, you will realize that convnets are not very good at recognizing transformations (e.g. 3d rotations) of the same object. That&#x27;s probably why so many training examples are required to make them work well.<p>Also, if you look at errors made by state of the art models, some of them are obvious (to a human) objects, classified as something entirely different and unrelated. Which leads me to believe that object recognition is not completely solved until a model has some kind of common sense, either build in, or acquired during training.","comments":[],"comments_count":0,"level":4,"url":"item?id=16504423"}],"comments_count":1,"level":3,"url":"item?id=16499047"}],"comments_count":2,"level":2,"url":"item?id=16497317"}],"comments_count":3,"level":1,"url":"item?id=16495982"},{"id":16498248,"user":"mark_l_watson","time":1519955400,"time_ago":"8 months ago","type":"comment","content":"<p>Andrew Ng’s older machine learning MOOC class was excellent. I took it once, and took it again a few years later. In the last 8 months I also took his new deep learning set of courses. All really good stuf! (I have been working in the field since the 1980s, but constantly refreshing helps me. And Andrew’s lectures are great fun, he is a teaching artist.","comments":[],"comments_count":0,"level":1,"url":"item?id=16498248"},{"id":16499448,"user":"johnx123-up","time":1519970490,"time_ago":"8 months ago","type":"comment","content":"<p>I used to download all ML videos for offline ad hoc watching. But, this crash course videos cannot be downloaded using &#x27;youtube-dl&#x27;. Any recommendations?","comments":[{"id":16500734,"user":"abhishekjha","time":1519991240,"time_ago":"8 months ago","type":"comment","content":"<p>Where are the videos anyway? I don&#x27;t see any play button or ay console to play the videos.","comments":[],"comments_count":0,"level":2,"url":"item?id=16500734"},{"id":16499795,"user":"choutos","time":1519976134,"time_ago":"8 months ago","type":"comment","content":"<p>Use the time you spend trying to find how to download the videos actually watching them, doing the readings and practising the exercises.","comments":[],"comments_count":0,"level":2,"url":"item?id=16499795"}],"comments_count":2,"level":1,"url":"item?id=16499448"},{"id":16498456,"user":"swyx","time":1519957561,"time_ago":"8 months ago","type":"comment","content":"<p>i completed the andrew ng course recently, and felt that the difficulty dropped a lot in the second half of the course (for example, he stops giving homeworks). im hoping for more in his new DL courses","comments":[{"id":16502531,"user":"Choco31415","time":1520006248,"time_ago":"8 months ago","type":"comment","content":"<p>I&#x27;ve taken the CNN and RNN (parts 4 and 5) classes of his new DL specialization, and they both area about as rigorous as you wanted. I do have to give a warning though that the last class starts so see some confusing mistakes in the HW. For example, the expected output given is from an outdated HW version.","comments":[{"id":16516949,"user":"swyx","time":1520199782,"time_ago":"8 months ago","type":"comment","content":"<p>sigh. well i hope the support is good.","comments":[],"comments_count":0,"level":3,"url":"item?id=16516949"}],"comments_count":1,"level":2,"url":"item?id=16502531"}],"comments_count":2,"level":1,"url":"item?id=16498456"}],"comments_count":11,"level":0,"url":"item?id=16495866"},{"id":16496534,"user":"bpesquet","time":1519939733,"time_ago":"8 months ago","type":"comment","content":"<p>The choice of TensorFlow is a bit disappointing for a beginner-focused course which looks really solid otherwise. Business seems to have gotten priority over pedagogy in that case.<p>I see TensorFlow as the Angular of machine learning: first on the market, powerful but unwiedly. Like Angular, it will ultimately get superseded by tools with a nicer API (scikit-learn, Keras) or more versatility (PyTorch). Like Angular, it&#x27;s probably not the best choice for a beginner to invest time into.","comments":[{"id":16496608,"user":"dragandj","time":1519940231,"time_ago":"8 months ago","type":"comment","content":"<p>Add to that that TensorFlow was practically a latecomer, not the first to market.","comments":[],"comments_count":0,"level":1,"url":"item?id=16496608"}],"comments_count":1,"level":0,"url":"item?id=16496534"},{"id":16496703,"user":"ivan_ah","time":1519940959,"time_ago":"8 months ago","type":"comment","content":"<p>I love the prework section: <a href=\"https:&#x2F;&#x2F;developers.google.com&#x2F;machine-learning&#x2F;crash-course&#x2F;prereqs-and-prework\" rel=\"nofollow\">https:&#x2F;&#x2F;developers.google.com&#x2F;machine-learning&#x2F;crash-course&#x2F;...</a> It&#x27;s a very good mix of topic and skills that I think everyone should learn, even if not directly planning to do ML or DL. If y&#x27;all are looking for a compact (and inexpensive) textbook on linear algebra that comes with all prerequisites you can check out: <a href=\"https:&#x2F;&#x2F;gum.co&#x2F;noBSLA\" rel=\"nofollow\">https:&#x2F;&#x2F;gum.co&#x2F;noBSLA</a> (disclaimer: I wrotes it)","comments":[],"comments_count":0,"level":0,"url":"item?id=16496703"},{"id":16493736,"user":"chris_va","time":1519923616,"time_ago":"8 months ago","type":"comment","content":"<p>Link to the exercises:\n<a href=\"https:&#x2F;&#x2F;developers.google.com&#x2F;machine-learning&#x2F;crash-course&#x2F;exercises\" rel=\"nofollow\">https:&#x2F;&#x2F;developers.google.com&#x2F;machine-learning&#x2F;crash-course&#x2F;...</a>","comments":[],"comments_count":0,"level":0,"url":"item?id=16493736"},{"id":16494203,"user":"mrdmnd","time":1519925988,"time_ago":"8 months ago","type":"comment","content":"<p>As someone who just did this internally:<p>Do it. It&#x27;s worth your time. Very well paced exercises, and it walks you through the flow quite nicely.","comments":[{"id":16506941,"user":"tostitos1979","time":1520036157,"time_ago":"8 months ago","type":"comment","content":"<p>I went through the first a couple of topics. It seemed very disjointed. Different people presenting, different exercises. Was it like this internally? Or is this heavily &quot;annotated&quot;?","comments":[],"comments_count":0,"level":1,"url":"item?id=16506941"}],"comments_count":1,"level":0,"url":"item?id=16494203"},{"id":16495966,"user":"zitterbewegung","time":1519936302,"time_ago":"8 months ago","type":"comment","content":"<p>I like this move from google. Sure it is targeted for you to use Tensorflow but more courseware and MOOCs help everyone. I love doing self study and Tensorflow&#x27;s tutorials are top notch. Since I can also use Tensorflow on my own hardware and anywhere else I really love better docs and MOOCs in general. What I really want to do is understand enough Tensorflow to reproduce other people&#x27;s experiments in their papers on github and I think this would be one of the best ways to do this. Of course, this may eat into a bunch of companies that have paid programs for ML but its Google&#x27;s prerogative to make ML cheaper and easier to deploy and learn so I am all for that.","comments":[],"comments_count":0,"level":0,"url":"item?id=16495966"},{"id":16499240,"user":"blueside","time":1519967839,"time_ago":"8 months ago","type":"comment","content":"<p><i>we recommend that students meet the following prerequisites:Mastery of intro-level algebra. You should be comfortable with variables and coefficients, linear equations, graphs of functions, and histograms</i><p>Any book suggestions to getting up to speed in this area?","comments":[{"id":16499345,"user":"jpamata","time":1519969038,"time_ago":"8 months ago","type":"comment","content":"<p>If you&#x27;re looking for books, have a look at Schaum&#x27;s Outline of Precalculus [0]. Khan Academy [1] is also good and there&#x27;s this MOOC on coursera called Data Science Math Skills [2].<p>[0] <a href=\"https:&#x2F;&#x2F;www.amazon.com&#x2F;Schaums-Outline-Precalculus-3rd-Problems&#x2F;dp&#x2F;0071795596\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.com&#x2F;Schaums-Outline-Precalculus-3rd-Probl...</a><p>[1] <a href=\"https:&#x2F;&#x2F;www.khanacademy.org&#x2F;math\" rel=\"nofollow\">https:&#x2F;&#x2F;www.khanacademy.org&#x2F;math</a><p>[2] <a href=\"https:&#x2F;&#x2F;www.coursera.org&#x2F;learn&#x2F;datasciencemathskills\" rel=\"nofollow\">https:&#x2F;&#x2F;www.coursera.org&#x2F;learn&#x2F;datasciencemathskills</a>","comments":[],"comments_count":0,"level":1,"url":"item?id=16499345"},{"id":16499314,"user":"megaman22","time":1519968650,"time_ago":"8 months ago","type":"comment","content":"<p>I always liked the Saxon books[1], since they involved so much spaced repetition if you did the problem sets that it beat the symbolic manipulation into your long-term memory.<p>[1] <a href=\"http:&#x2F;&#x2F;amzn.to&#x2F;2FH3bXL\" rel=\"nofollow\">http:&#x2F;&#x2F;amzn.to&#x2F;2FH3bXL</a>","comments":[],"comments_count":0,"level":1,"url":"item?id=16499314"},{"id":16499343,"time":1519968986,"time_ago":"8 months ago","type":"comment","content":"[deleted]","deleted":true,"comments":[],"comments_count":0,"level":1,"url":"item?id=16499343"},{"id":16499266,"user":"ropable","time":1519968132,"time_ago":"8 months ago","type":"comment","content":"<p>Khan Academy probably has this covered.","comments":[{"id":16499273,"user":"toomuchtodo","time":1519968191,"time_ago":"8 months ago","type":"comment","content":"<p>A shame Google doesn’t just link to the Khan Academy course.","comments":[{"id":16499468,"user":"earth2mars","time":1519970776,"time_ago":"8 months ago","type":"comment","content":"<p>not true. they do have khan academy link where applicable. for example for the algebra ones. check below link <a href=\"https:&#x2F;&#x2F;developers.google.com&#x2F;machine-learning&#x2F;crash-course&#x2F;prereqs-and-prework#prerequisites\" rel=\"nofollow\">https:&#x2F;&#x2F;developers.google.com&#x2F;machine-learning&#x2F;crash-course&#x2F;...</a>","comments":[],"comments_count":0,"level":3,"url":"item?id=16499468"}],"comments_count":1,"level":2,"url":"item?id=16499273"}],"comments_count":2,"level":1,"url":"item?id=16499266"}],"comments_count":6,"level":0,"url":"item?id=16499240"},{"id":16494555,"user":"austenallred","time":1519928138,"time_ago":"8 months ago","type":"comment","content":"<p>Shameless plug: Lambda School (YC S17) is also putting on a free Machine Learning crash course (we call it a mini bootcamp), followed by an optional 6-12 month course that you pay for once you get a job in data science (it’s free until then, and always free if you don’t get a job in ML).<p><a href=\"https:&#x2F;&#x2F;lambdaschool.com&#x2F;machine-learning-bootcamp&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;lambdaschool.com&#x2F;machine-learning-bootcamp&#x2F;</a>","comments":[{"id":16494854,"user":"eorge_g","time":1519930008,"time_ago":"8 months ago","type":"comment","content":"<p>is there a more fleshed out outline for what will be covered here? sounds interesting","comments":[],"comments_count":0,"level":1,"url":"item?id=16494854"}],"comments_count":1,"level":0,"url":"item?id=16494555"},{"id":16495248,"user":"redditmigrant","time":1519932241,"time_ago":"8 months ago","type":"comment","content":"<p>As someone who is trying to learn ML, all the courses available are hugely helpful. One thing I wish I had easy access to is the process that someone goes through while trying to build a model on a real dataset.<p>Specifically following questions are the ones I struggle with:<p>1. How did you figure out what features would be useful?<p>2. How did you figure out what algorithm(s) are appropriate?<p>3. how and why did you massage the data in a specific way?","comments":[{"id":16496252,"user":"bkanber","time":1519937779,"time_ago":"8 months ago","type":"comment","content":"<p>&gt; How did you figure out what features would be useful?<p>There are various feature engineering and feature extraction techniques. Filter methods, wrapper methods, and embedded methods. Principle component analysis, autoencoding, variance analysis, linear discriminant analysis, Gini index, genetic algorithms, etc -- the feature selection process will depend on the dataset, the problem domain, the analysis algorithm you ultimately use, etc.<p>&gt; How did you figure out what algorithm(s) are appropriate?<p>Also depends on the problem domain. Discrete or continuous data? Categorical features, numeric features, features as bitmasks. Do you need a probabilistic outcome? Etc.<p>Generally you start with the easiest algorithms in your toolbox to see how viable they are. For a classification task I&#x27;ll almost always start with a naive Bayes classifier (if the data allows) and&#x2F;or a random forest and see how they perform. If the problem domain is highly non-linear you might start with a support vector or kernel method. Neural network is a last resort for me, as I find most classification problems can be solved to a high accuracy much more simply.<p>&gt; how and why did you massage the data in a specific way?<p>This relates back to #1 -- you should only massage data based on what your feature engineering tells you to do. Sometimes you might want to remove outliers or clean up the training data, but only if the outliers really should be removed from consideration entirely.","comments":[{"id":16497102,"user":"redditmigrant","time":1519944260,"time_ago":"8 months ago","type":"comment","content":"<p>Thanks for the response!<p>&gt; There are various feature engineering and feature extraction techniques. Filter methods, wrapper methods, and embedded methods. Principle component analysis, autoencoding, variance analysis, linear discriminant analysis, Gini index, genetic algorithms, etc -- the feature selection process will depend on the dataset, the problem domain, the analysis algorithm you ultimately use, etc.<p>Obviously thats a big toolbox and Im sure it takes time to develop an intuitive understanding for all these techniques. What I hope for is some sort guidebook on what to look for when I stumble across problems. So lets say you try out an algorithm and your accuracy(or whatever evaluation criteria you might have) is low. How do you figure out if thats due to the algorithm, or is it due to (or due to the lack of) feature selection?<p>An analogy that might be useful is, when I see my database queries are slow, I can use EXPLAIN to guide what knobs to tune. Obviously it requires understanding what indexes are, what a full table scan is etc. etc. but the EXPLAIN plan provides a guidebook of sorts.","comments":[{"id":16498990,"user":"bkanber","time":1519964520,"time_ago":"8 months ago","type":"comment","content":"<p>Every problem is different, so the only advice I can give is: research research research! Do the hard work up-front; figure out how to <i>describe</i> your problem in a mathematical sense, and identify the right tools to use for the shape of your input, output and problem dimensions. What&#x27;s the distribution of each dimension. Are the relationships linear, nonlinear, clustered, dispersed, logarithmic, etc. Once you know those things, you&#x27;re able to narrow in on the right tools and analyses to use.","comments":[],"comments_count":0,"level":3,"url":"item?id=16498990"}],"comments_count":1,"level":2,"url":"item?id=16497102"}],"comments_count":2,"level":1,"url":"item?id=16496252"},{"id":16495587,"user":"disgruntledphd2","time":1519934176,"time_ago":"8 months ago","type":"comment","content":"<p>If you are willing to do the work, Frank Harrell&#x27;s Regression Modeling Strategies is a pretty good introduction to a lot of this.<p>It&#x27;s written for a very different set of problems than typical ML, but it has lots of really good advice for practical problems in data analysis and prediction (which is another term for ML).<p>Mostly people learn this stuff by experience. Find a dataset, choose a predictor, filter, clean and massage your data till you get better metrics&#x2F;understanding (preferably both). Rinse, repeat on many different datasets and problems, and you&#x27;ll know how to do this.","comments":[],"comments_count":0,"level":1,"url":"item?id=16495587"},{"id":16497430,"user":"rripken","time":1519947512,"time_ago":"8 months ago","type":"comment","content":"<p>Georgia Tech has an graduate course on Machine Learning CS-7641. There are four major projects in that course where the students must analyze (and re-analyze) a chosen dataset. Here is an example of the code one student used: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;JonathanTay&#x2F;CS-7641-assignment-1\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;JonathanTay&#x2F;CS-7641-assignment-1</a>  \nUnfortunately all the plotting code was intentionally removed. Sometimes the project reports make it online (<a href=\"http:&#x2F;&#x2F;www.dudonwai.com&#x2F;docs&#x2F;gt-omscs-cs7641-a3.pdf?pdf=gt-omscs-cs7641-a3\" rel=\"nofollow\">http:&#x2F;&#x2F;www.dudonwai.com&#x2F;docs&#x2F;gt-omscs-cs7641-a3.pdf?pdf=gt-o...</a>) .  Having spent several months of my life on the assignments I&#x27;d say that only way to learn it is to try a whole bunch of different things and try and figure out why some work and why some don&#x27;t.  Sometimes you learn from the failures, sometimes from the unexpected successes.","comments":[],"comments_count":0,"level":1,"url":"item?id=16497430"},{"id":16498428,"user":"wepple","time":1519957244,"time_ago":"8 months ago","type":"comment","content":"<p>Take a look at some of the highly rated kernels on Kaggle - they’re often well annotated with the types of things you’re looking for, including actual experimentation to test ideas.<p>Edit: fix autocorrect","comments":[],"comments_count":0,"level":1,"url":"item?id=16498428"}],"comments_count":6,"level":0,"url":"item?id=16495248"},{"id":16497471,"user":"rohitpaulk","time":1519947891,"time_ago":"8 months ago","type":"comment","content":"<p>I&#x27;ve compiled this into a Todoist template you can import - it&#x27;s got links to each module + times.<p>To preview: <a href=\"http:&#x2F;&#x2F;todotemplates.com&#x2F;posts&#x2F;HRtYanEq8zMgRL5fz&#x2F;google-ml-crash-course\" rel=\"nofollow\">http:&#x2F;&#x2F;todotemplates.com&#x2F;posts&#x2F;HRtYanEq8zMgRL5fz&#x2F;google-ml-c...</a><p>To import directly: <a href=\"https:&#x2F;&#x2F;todoist.com&#x2F;importFromTemplate?t_url=https%3A%2F%2Fd1aspxi4rjqbaz.cloudfront.net%2F24fc6edd6dff480670528e9f842cb494_Google%2520ML%2520crash%2520course.csv\" rel=\"nofollow\">https:&#x2F;&#x2F;todoist.com&#x2F;importFromTemplate?t_url=https%3A%2F%2Fd...</a>","comments":[],"comments_count":0,"level":0,"url":"item?id=16497471"},{"id":16499452,"user":"ak_yo","time":1519970527,"time_ago":"8 months ago","type":"comment","content":"<p>Cool tutorial, but I&#x27;m not entirely sure what makes this ML -- aside from neural nets, this is more or less the material you&#x27;d encounter in a basic applied statistics or regression analysis course, minus material on estimating uncertainty, modeling survival or time-series data, and causal inference. I suspect you&#x27;d benefit more from a 50 minute tutorial on those than neural nets.","comments":[],"comments_count":0,"level":0,"url":"item?id=16499452"},{"id":16495423,"user":"bjourne","time":1519933224,"time_ago":"8 months ago","type":"comment","content":"<p>I want to ask people who know ML well if the hype is warranted?<p>Billions of courses, web sites, job applications and HN posts. The subject seem to have taken off massively in the last two years. I mean image and speech recognition is pretty cool (when it works!), but hardly that earth shattering, is it?","comments":[{"id":16497270,"user":"randcraw","time":1519945826,"time_ago":"8 months ago","type":"comment","content":"<p>Deep nets are deservedly big because they&#x27;ve managed to improve upon <i>most</i> of the decades-old state-of-the-art methods in the world of signal processing (DSP): voice, image, video, game play, and a significant amount of natural language.  No other single computational&#x2F;algorithmic method has achieved so much in so many domains, ever.  That&#x27;s revolutionary.<p>The rate of advance using deep nets in signal processing will likely slow down now, but they aren&#x27;t going away, not in the foreseeable future.<p>The hype around DNNs arose when we took our unbridled enthusiasm for what&#x27;s they&#x27;ve achieved in DSP and extended it to other domains where data is less &#x27;dense&#x27; and thus aren&#x27;t as amenable to fast de&#x2F;convolution in N-D space or time.<p>Will DNNs revolutionize or introduce <i>all</i> the techniques needed to achieve AGI&#x2F;Strong AI?  I very much doubt it.  As yet, there&#x27;s little sign that DNNs can perform relational operations on interdependent symbols, like the transforms available via type theory, bayesian nets, or predicate logic.<p>The multitude of disparate facts and semantics in a rich knowledgebase can&#x27;t be organized into dense matrices the way that continuous signals can, so the SIMD operations that are so effective in DSP won&#x27;t implement the rich transformations needed in a relational fact-based knowledge space equally as well, if at all.  Thus DNNs almost surely aren&#x27;t going to take us to the heights of logical or compositional thinking that human level intelligence requires.<p>But how far up relational mountain <i>will</i> DNNs take us?  I suspect that won&#x27;t be known for a decade or longer.  But even if we don&#x27;t reach the summit, we&#x27;ll be considerably closer than we were before.","comments":[{"id":16506673,"user":"wepple","time":1520032892,"time_ago":"8 months ago","type":"comment","content":"<p>This is a really fantastic and interesting look at ML, for someone who’s just beginning first steps. Any recommendations on where else I can read about the areas DNNs and associated stuff (GANs, RL, etc) in terms of what they’ll likely not be capable of in the near mid term?","comments":[],"comments_count":0,"level":2,"url":"item?id=16506673"},{"id":16498466,"user":"swyx","time":1519957682,"time_ago":"8 months ago","type":"comment","content":"<p>just commenting to thank you for a very accessible assessment of a simple question &quot;is the hype warranted&quot;. please do more of these on HN (or elsewhere!)","comments":[],"comments_count":0,"level":2,"url":"item?id=16498466"}],"comments_count":2,"level":1,"url":"item?id=16497270"},{"id":16496062,"user":"bkanber","time":1519936830,"time_ago":"8 months ago","type":"comment","content":"<p>The hype is and isn&#x27;t warranted.<p>ML is a much broader field than just neural networks. The hype for ML, in general, I think is warranted. We hit an inflection point when AWS launched and scalable processing power became cheap. It became cheap to process tons of data and generate insights. I don&#x27;t have hard numbers on this, but probably 90-95% of machine learning used in practice is NOT neural networks, and have accuracies in the 90%+ arena. So ML in general -- sure, hype warranted.<p>Neural networks are the new hot topic, and the hype isn&#x27;t fully warranted yet. TensorFlow made them very popular in the developer community; this is a good thing because it&#x27;s spurring more investment and research in ANNs. But for <i>any given</i> problem, odds are that a neural network is not the best (ie, most accurate or cheapest) way to solve it. Neural networks do have specific problem domains where they are the state of the art, but for most other problem domains there exists a better solution. So I&#x27;d say that neural networks are a little over-hyped right now, but with a new generation of developers learning about and experimenting with ANNs, that will change in a few years. I think we&#x27;re about to see an explosion of ANN usefulness over the next few years.<p>TLDR: ML is very useful but is more than neural networks; neural networks need a little more progress to catch up to the tensorflow hype.","comments":[],"comments_count":0,"level":1,"url":"item?id=16496062"},{"id":16496314,"user":"ageitgey","time":1519938240,"time_ago":"8 months ago","type":"comment","content":"<p>Computers are automation tools that increase human efficiency by doing the grunt work for you - but they are limited to automating the tasks that can be captured as a set of rules in code. When we figure a new way to model more complex tasks in code, a whole new set of things can be automated.<p>Here&#x27;s a concrete example: Before spreadsheets existed, there used to be legions of accountants who created complex ledgers on paper and added up all numbers to track how a business was doing. You&#x27;d literally mail off your sales numbers to an accounting team somewhere and wait three days to get the latest report generated and sent back. Sure they had calculators to add numbers, but the computers of the day didn&#x27;t understand how those numbers related to each other. The human still had to do most of the work to create the reports.<p>The big idea of spreadsheets was to make the computer manage the more complex task of knowing how different numbers in a report related to each other. It made most ledger tasks totally automatic once the initial report was defined. Now a single accountant could do the work of the entire accounting team - and more accurately and in less time! There were stories of the first spreadsheet testers having to delay mailing back their financial reports by a few days because their clients would be suspicious if they mailed them back too fast.<p>Nearly overnight accounting got a lot more efficient and companies made more money. T&quot;What If&quot; modeling that used to be too slow and cost prohibitive to do was now it was quick and easy. Companies could plan more intelligently. The spreadsheet was a true game changer.<p>This same pattern happens every time the bar is raised on the complexity of what can be automated and Machine Learning raises the bar one giant notch. Previously we were limited to automating tasks that a smart coder could describe as discrete steps in code. But with ML, the computer can figure out it&#x27;s own rules just by looking at data. That means in many cases you can solve very hard problems just by collecting a lot of data. Lots and lots of things that used to be done by large groups of people will now be able to be done with a single computer.<p>In that sense, ML is a total game changer. Don&#x27;t focus on the specific applications thus far. Focus on the idea that all kinds of tasks that used to require humans can now be automated with a little bit of applied ML. The opportunities are literally everywhere.<p>In a few years, ML won&#x27;t be some esoteric technique used by a few people. It will be a core skill that everyone uses or touches in some way. It&#x27;s going to creep into everything everywhere because it&#x27;s just so darn useful.","comments":[],"comments_count":0,"level":1,"url":"item?id=16496314"},{"id":16497262,"user":"randcraw","time":1519945772,"time_ago":"8 months ago","type":"comment","content":"<p>Deep nets are deservedly big because they&#x27;ve managed to improve upon <i>all</i> of the decades-old state-of-the-art methods in the world of signal processing (DSP): voice, image, video, game play, and a much of natural language.  No other single computational&#x2F;algorithmic method has achieved so much, in so many domains, ever.  That&#x27;s revolutionary.<p>The advances made by deep nets in signal processing will likely slow down now, but they aren&#x27;t going away, not in the foreseeable future.<p>The hype around DNNs arose when we took our unbridled enthusiasm for what&#x27;s they&#x27;ve achieved in DSP and extend it to other domains with data that&#x27;s less &#x27;dense&#x27; and thus aren&#x27;t as amenable to de&#x2F;convolution in N-D space or time.<p>Will DNNs revolutionize or introduce <i>all</i> the techniques needed to achieve AGI&#x2F;Strong AI?  I very much doubt it.  As yet, there&#x27;s little sign that DNNs can perform relational operations on interdependent symbols, like the transforms available via type theory, bayesian nets, or predicate logic.<p>The multitude of disparate facts and semantics in a rich knowledgebase can&#x27;t be organized into dense matrices the way that continuous signals can, so the SIMD operations that are so effective in DSP won&#x27;t implement the rich transformations needed in a relational fact-based knowledge space equally as well, if at all.  Thus DNNs almost surely aren&#x27;t going to take us to the heights of logical or compositional thinking that human level intelligence requires.<p>But how far up relational mountain <i>will</i> DNNs take us?  I suspect that won&#x27;t be known for a decade or longer.  But even if we don&#x27;t reach the summit, it&#x27;ll be higher than we were before.","comments":[],"comments_count":0,"level":1,"url":"item?id=16497262"},{"id":16496709,"user":"penetrarthur","time":1519941009,"time_ago":"8 months ago","type":"comment","content":"<p>I&#x27;ve been reading about it &quot;getting popular during the last two years&quot; for at least 6 years.","comments":[],"comments_count":0,"level":1,"url":"item?id=16496709"}],"comments_count":7,"level":0,"url":"item?id=16495423"},{"id":16494145,"user":"kidfiji","time":1519925641,"time_ago":"8 months ago","type":"comment","content":"<p>I&#x27;ve been itching to learn a bit about the industry and to be able to create &amp; train ML models myself; I&#x27;m glad Google decided to put out a course where I wouldn&#x27;t have to worry about the quality of instruction.","comments":[],"comments_count":0,"level":0,"url":"item?id=16494145"},{"id":16498112,"user":"msaharia","time":1519954094,"time_ago":"8 months ago","type":"comment","content":"<p>On a sidenote, can someone talk about what kind of tools are being used to integrate the subtitles and scrolling behavior over a youtube video in this course? Is there an OS implementation?","comments":[],"comments_count":0,"level":0,"url":"item?id=16498112"},{"id":16495843,"user":"rtfs","time":1519935616,"time_ago":"8 months ago","type":"comment","content":"<p>Thanks Google! Now I know that I am a ML guy, as an economist and econometrician. Yes, we shoot this on all kind of stuff, though with a clear business acumen or economic policy thinking.","comments":[],"comments_count":0,"level":0,"url":"item?id=16495843"},{"id":16494700,"user":"Abundnce10","time":1519929155,"time_ago":"8 months ago","type":"comment","content":"<p>I have a new project at work: I need to take in a free form text of recipe ingredients (e.g. &quot;1&#x2F;2 cup diced onions&quot;, &quot;two potatoes, cut into 1-inch cubes&quot;, etc.) and build a program that identifies the ingredient (e.g. onion, potato), as well as the quantity (e.g. 0.5 cup, 2.0 units). Would machine learning be an applicable approach to solving this? Right now I&#x27;m just planning on using an NLP library to parse out the various parts of the ingredient text.","comments":[{"id":16496743,"user":"imh","time":1519941270,"time_ago":"8 months ago","type":"comment","content":"<p>I did the same a while back, and i suggest using an NLP library to extract parts of speech and parse trees and building a quick dirty solution. I did the same a while back and the strong solution isn&#x27;t much better (took a week+) than the hacky manual one based on specific keywords like &quot;teaspoon&quot; and parts of speech&#x2F;parse trees (took a few hours).","comments":[],"comments_count":0,"level":1,"url":"item?id=16496743"},{"id":16495097,"user":"maffydub","time":1519931363,"time_ago":"8 months ago","type":"comment","content":"<p>It&#x27;s not very sexy, but I think you might find it easier and more robust just to use an NLP library.<p>I built something similar (albeit for a relatively limited database of recipes) for a hackathon a couple of weeks back.  I didn&#x27;t even use a proper NLP library, just some simple hand-rolled pattern-matching, and got pretty good results.<p>Good luck!","comments":[{"id":16495204,"user":"Abundnce10","time":1519931958,"time_ago":"8 months ago","type":"comment","content":"<p>I think you&#x27;re right. Did you happen to open-source your code from the hackathon? I&#x27;d love to take a look at your approach if you don&#x27;t mind.","comments":[{"id":16495321,"user":"maffydub","time":1519932698,"time_ago":"8 months ago","type":"comment","content":"<p>Sorry, I normally would but one of the other team members is considering taking the hack forward and wanted to keep it closed for now.  (It&#x27;s hard to see how much competitive advantage he&#x27;d have from 48 hours of very-hacked-together code, but so few hackathon projects get taken forward that I didn&#x27;t want to discourage him!)<p>The approach was to tokenize the input and then do basic pattern-matching on it, with separate dictionaries of quantity units (e.g. cup, oz, pound) ingredients, processing words (e.g. &quot;chopped&quot;) and throw-away words (e.g. &quot;of&quot;).  In fact, possibly the most complicated part was parsing &quot;2.5&quot;, &quot;2 and a half&quot; and &quot;2½&quot; all to the same thing.","comments":[],"comments_count":0,"level":3,"url":"item?id=16495321"}],"comments_count":1,"level":2,"url":"item?id=16495204"}],"comments_count":2,"level":1,"url":"item?id=16495097"},{"id":16498295,"user":"radarsat1","time":1519955810,"time_ago":"8 months ago","type":"comment","content":"<p>Whether you end up using a machine learning approach or hand-crafting the solution, I recommend you work in a ML-like manner, dividing up the data you have into test and training sets and using cross-validation to evaluate your work.<p>For you actual question, yes, as others have said it might be just an NLP&#x2F;regexp problem.  Otherwise, you could look at ingredients identification as a classification approach.  I recommend checking FastText, NLTK, familiarize yourself with word dictionaries and pre-trained vectors that are available, these tools might help generalize your work beyond the data you have at hand.<p>(E.g. if it works well on your data using pre-trained word vectors from wikipedia, chances are it might work on examples you don&#x27;t even have.)","comments":[],"comments_count":0,"level":1,"url":"item?id=16498295"},{"id":16495385,"user":"telchar","time":1519933029,"time_ago":"8 months ago","type":"comment","content":"<p>This seems relevant: <a href=\"https:&#x2F;&#x2F;open.blogs.nytimes.com&#x2F;2015&#x2F;04&#x2F;09&#x2F;extracting-structured-data-from-recipes-using-conditional-random-fields&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;open.blogs.nytimes.com&#x2F;2015&#x2F;04&#x2F;09&#x2F;extracting-structu...</a>","comments":[],"comments_count":0,"level":1,"url":"item?id=16495385"},{"id":16496094,"user":"bkanber","time":1519936968,"time_ago":"8 months ago","type":"comment","content":"<p>This is an NLP problem if all you&#x27;re trying to do is extract nouns.","comments":[],"comments_count":0,"level":1,"url":"item?id=16496094"}],"comments_count":7,"level":0,"url":"item?id=16494700"},{"id":16528936,"user":"DeepWorker","time":1520345524,"time_ago":"7 months ago","type":"comment","content":"<p>The ulterior motive behind this is to increase usage of Google Cloud (according to this answer on Quora: <a href=\"https:&#x2F;&#x2F;www.quora.com&#x2F;Why-did-Google-release-their-machine-learning-crash-course&#x2F;answer&#x2F;Carlos-Matias-La-Borde?share=00711d71&amp;srid=XvlZ\" rel=\"nofollow\">https:&#x2F;&#x2F;www.quora.com&#x2F;Why-did-Google-release-their-machine-l...</a>)","comments":[],"comments_count":0,"level":0,"url":"item?id=16528936"},{"id":16495012,"user":"qwerty456127","time":1519930822,"time_ago":"8 months ago","type":"comment","content":"<p>Cool! Does anybody also know a good blockchain crash course of similar kind so one could grok all the major buzzwords of  today?","comments":[{"id":16495094,"user":"lanewinfield","time":1519931357,"time_ago":"8 months ago","type":"comment","content":"<p>I loved this one a lot: <a href=\"https:&#x2F;&#x2F;anders.com&#x2F;blockchain&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;anders.com&#x2F;blockchain&#x2F;</a>","comments":[{"id":16500694,"user":"abhishekjha","time":1519990689,"time_ago":"8 months ago","type":"comment","content":"<p>This is what got me a proper intuition for why a blockchain can be useful.","comments":[],"comments_count":0,"level":2,"url":"item?id=16500694"}],"comments_count":1,"level":1,"url":"item?id=16495094"}],"comments_count":2,"level":0,"url":"item?id=16495012"},{"id":16494188,"user":"throwaway84742","time":1519925904,"time_ago":"8 months ago","type":"comment","content":"<p>Unless you have already invested a lot of time into learning (and building on top of) TF, I would advise to pick up PyTorch. It’s much easier to learn and use (imperative!), and has higher performance on common workloads.","comments":[{"id":16497175,"user":"jazoom","time":1519944910,"time_ago":"8 months ago","type":"comment","content":"<p>Except there aren&#x27;t many good resources to learn it and the documentation isn&#x27;t very good. Hopefully this will improve soon.","comments":[{"id":16498645,"user":"throwaway84742","time":1519960064,"time_ago":"8 months ago","type":"comment","content":"<p>On the positive side with PyTorch you don’t need nearly as much documentation as you would with TF. TF in general feels like it’s fighting you every step of the way. There’s a lot of cognitive overhead. Not so with PyTorch. Everything is straightforward, and can be run&#x2F;examined in ipython.","comments":[],"comments_count":0,"level":2,"url":"item?id=16498645"}],"comments_count":1,"level":1,"url":"item?id=16497175"}],"comments_count":2,"level":0,"url":"item?id=16494188"},{"id":16498680,"user":"aabajian","time":1519960441,"time_ago":"8 months ago","type":"comment","content":"<p>While I like the idea, in principle, that you don&#x27;t need a CS education to use AI&#x2F;ML, I doubt it. Here&#x27;s a problem that cropped up today: Our instance ran out of hard drive space on a training set of ~400,000 images. The individual images were only 375 GB, but took up 1.5T when converted to Numpy matrices. Why? The arrays were converted to standard int arrays  (32-bit x 3 channels) when they could&#x27;ve fit into short (8-bit x 3 channels). Each image was 4x as large as it needed to be.<p>You can certainly use high-level ML tools (like Keras), but it takes a great deal of work to wrangle your data into a usable format, and even more knowledge to debug an ineffective network.","comments":[],"comments_count":0,"level":0,"url":"item?id=16498680"},{"id":16499687,"time":1519974195,"time_ago":"8 months ago","type":"comment","content":"[deleted]","deleted":true,"comments":[],"comments_count":0,"level":0,"url":"item?id=16499687"},{"id":16494124,"user":"zengid","time":1519925550,"time_ago":"8 months ago","type":"comment","content":"<p>I wonder if they are doing this to complete with course.fast.ai","comments":[{"id":16494183,"user":"bllguo","time":1519925862,"time_ago":"8 months ago","type":"comment","content":"<p>IMO teaching people ML is good in general for Google. 1. it spreads the use of tensorflow, 2. it increases not only tensorflow, but also Google&#x27;s mindshare, 3. it trains people that may become future Google employees, and&#x2F;or serves as a useful resource for existing employees","comments":[{"id":16494403,"user":"jxub","time":1519927152,"time_ago":"8 months ago","type":"comment","content":"<p>Also 4) will increment the usage of TPU&#x27;s on Google Cloud Platform and subsequently the revenue of their cloud offerings.","comments":[],"comments_count":0,"level":2,"url":"item?id=16494403"}],"comments_count":1,"level":1,"url":"item?id=16494183"},{"id":16494179,"user":"zeroxfe","time":1519925840,"time_ago":"8 months ago","type":"comment","content":"<p>This has been an internal course at Google for many years.","comments":[{"id":16504282,"user":"chishaku","time":1520015229,"time_ago":"8 months ago","type":"comment","content":"<p>I think that helps to prove the point.","comments":[],"comments_count":0,"level":2,"url":"item?id=16504282"}],"comments_count":1,"level":1,"url":"item?id=16494179"}],"comments_count":4,"level":0,"url":"item?id=16494124"},{"id":16494646,"user":"juanmirocks","time":1519928834,"time_ago":"8 months ago","type":"comment","content":"<p>The Google AI courses are also good for old seasoned ML practitioners who want to learn more about more recent deep learning techniques","comments":[],"comments_count":0,"level":0,"url":"item?id=16494646"},{"id":16494329,"user":"ariwilson","time":1519926688,"time_ago":"8 months ago","type":"comment","content":"<p>Having done this course 6 months ago, this is a fantastic introduction to the major concerns of practical machine learning.","comments":[],"comments_count":0,"level":0,"url":"item?id=16494329"},{"id":16499960,"user":"Animats","time":1519979193,"time_ago":"8 months ago","type":"comment","content":"<p>Can&#x27;t view. Requires a Google account.","comments":[{"id":16501541,"user":"Tepix","time":1520000866,"time_ago":"8 months ago","type":"comment","content":"<p>Have you tried to create one?","comments":[],"comments_count":0,"level":1,"url":"item?id=16501541"}],"comments_count":1,"level":0,"url":"item?id=16499960"},{"id":16496972,"user":"DiogoMCampos","time":1519943216,"time_ago":"8 months ago","type":"comment","content":"<p>How does this compare to the CS229 lectures by Andrew Ng? (the recorded lectures, not the MOOC)","comments":[{"id":16497498,"user":"manav","time":1519948230,"time_ago":"8 months ago","type":"comment","content":"<p>CS229 @ Stanford is very math&#x2F;proof intensive. This might be somewhat similar to CS221 or the Coursera course.","comments":[],"comments_count":0,"level":1,"url":"item?id=16497498"}],"comments_count":1,"level":0,"url":"item?id=16496972"},{"id":16500696,"time":1519990764,"time_ago":"8 months ago","type":"comment","content":"[deleted]","deleted":true,"comments":[],"comments_count":0,"level":0,"url":"item?id=16500696"},{"id":16499649,"user":"noahha","time":1519973538,"time_ago":"8 months ago","type":"comment","content":"<p>serving videos from youtube without alternatives doesn&#x27;t make it accessible. proxying  for identified videos esspecially videos from this crash course would be useful.","comments":[{"id":16501155,"user":"Mashimo","time":1519997010,"time_ago":"8 months ago","type":"comment","content":"<p>&gt;serving videos from youtube without alternatives doesn&#x27;t make it accessible.<p>Why is that?","comments":[],"comments_count":0,"level":1,"url":"item?id=16501155"}],"comments_count":1,"level":0,"url":"item?id=16499649"},{"id":16499326,"user":"gcb0","time":1519968828,"time_ago":"8 months ago","type":"comment","content":"<p>this site is so broken on firefox mobile they should be embarrassed.","comments":[],"comments_count":0,"level":0,"url":"item?id=16499326"},{"id":16494398,"user":"maximumkek","time":1519927099,"time_ago":"8 months ago","type":"comment","content":"<p>I have been programing html css and JS for a whole year and I cannot understand any of this pseudo intellectual mumbo jumbo","dead":true,"comments":[],"comments_count":0,"level":0,"url":"item?id=16494398"},{"id":16496992,"user":"loreteye","time":1519943310,"time_ago":"8 months ago","type":"comment","content":"<p>My friend partner was out dating his friend at work and he needed an hacker to help spy her device. He got (Roccoshadow   (at)   gmx   (.)   com) to help spy her iPhone,facebook,email,whatsapp,calls,skype and others.They literally helped him and now he have her whatsapp Spyed without her noticing.","dead":true,"comments":[],"comments_count":0,"level":0,"url":"item?id=16496992"},{"id":16494499,"user":"graycat","time":1519927782,"time_ago":"8 months ago","type":"comment","content":"<p>In the course, in lecture<p>&quot;Reducing Loss: Gradient Descent&quot;<p>is<p>&quot;Convex problems have only one minimum; that is, only one place where the slope is exactly 0. That minimum is where the loss function converges.&quot;<p>The first sentence is flatly wrong:  E.g., for positive integer n and the set of real numbers R, function f: R^n --&gt; R where for all x in R^n f(x) = 0, f is convex, concave, and linear, and for all x in R^n x is a minimum and a maximum of f.<p>Can there be uncountably infinitely many alternative minima for the Google ML problems?  Yes, e.g., just enter one of the independent variables twice.<p>The second sentence is nonsense.<p>Grotesque, outrageous incompetence!!!!<p>It has long been known that minimizing a convex function, even a differentiable convex function, with just gradient descent can be just horribly inefficient.  A LOT is known about how to do much better than just gradient descent.  E.g., there is Newton iteration (right, that Newton, hundreds of years ago) and quasi-Newton.  And there&#x27;s more.<p>Why so inefficient?  Well, draw a picture like Google did except use just two independent variables instead of just the one in the Google picture.  Then see that the resulting, convex &quot;bowl&quot; can be like a long, narrow boat with a very gentle slope in one direction and a very steep slope in an orthogonal direction.  Yes the cross section of the bowl can be, first cut, an ellipse with one short axis and one long one.  Sure, the axes are eigenvectors, etc. and the ellipse is part of a local quadratic approximation.  Well, gradient descent keeps going back and forth nearly parallel to the short axis of the ellipse and making nearly no progress on the long axis.  People have known this and known good things to do about it for, uh, at least half a century.<p>For the Google ML problems, might (1) tweak Newton iteration to improve the rate of convergence to a minimum or (2) at each iteration don&#x27;t get a gradient descent but get a supporting hyperplane of the epigraph of the convex function, as the iterations proceed, accumulate these hyperplanes, notice that they lead to an approximation of the full epigraph, and use linear programming or some tweak of that to minimize the hyperplane approximation to the convex function -- there is much more that can be said here.  By the way, the convex function for that ML problem is quite special, e.g., quadratic.<p>A lot has long been known and well polished in regression and classification, e.g., with TeX markup:<p>N.\\ R.\\ Draper and\nH.\\ Smith,\n{\\it Applied Regression Analysis,\\&#x2F;}\nJohn Wiley and Sons,\nNew York,\n1968.\\ \\<p>Leo Breiman,\nJerome H.\\ Friedman,\nRichard A.\\ Olshen,\nCharles J.\\ Stone,\n{\\it Classification and Regression Trees,\\&#x2F;}\nISBN 0-534-98054-6,\nWadsworth \\&amp; Brooks&#x2F;Cole,\nPacific Grove, California,\n1984.\\ \\<p>C.\\ Radhakrishna Rao,\n{\\it Linear Statistical Inference and\nIts Applications:\\ \\\nSecond Edition,\\&#x2F;}\nISBN 0-471-70823-2,\nJohn Wiley and Sons,\nNew York,\n1967.\\ \\<p>A good start on convexity is<p>Wendell H.\\ Fleming,\n{\\it Functions of Several Variables,\\&#x2F;}\nAddison-Wesley,\nReading, Massachusetts,\n1965.\\ \\<p>Total, fun, dessert ice cream on convexity is Jensen&#x27;s inequality; right away can use it to prove a lot of classic inequalities.<p>Gee, look on the upside!!!!  From this sample, the claims of machine learning (ML) revolutionizing the economy are nonsense!!!!  And for startups, don&#x27;t much have to worry about serious competition from Google!!!!","comments":[{"id":16497014,"user":"aoki","time":1519943501,"time_ago":"8 months ago","type":"comment","content":"<p>i would request that you stop critiquing &quot;machine learning&quot; based on the presentation in introductory online materials like this and the ng coursera course. you provide a lot of signal in general but i think these critiques do decrease your SNR.<p>i am certain that you are familiar with the &quot;usual&quot; statistics sequence. (for others: there are lower-division courses that use calculus in a few places but otherwise avoid it, focusing instead on memorizing procedures. there is the upper-division probability&#x2F;math stat sequence that uses calculus heavily but avoids analysis. and there is an intro phd sequence that finally gets into measure theory.) if you look at a coursera course that gives an high-level overview of practical statistics and simplifies its presentation to be accessible to people who never took calculus, you can criticize the very idea of a course that does not explain the measure-theoretic issues, but it makes no sense to use it to criticize the field of statistics, or to criticize the competence of others in the institution that produced it.<p>here, google is producing introductory training materials for developers. many developers have never taken calculus, let alone optimization, statistics, or analysis, and when i took MLCC internally, you were supposed to go through this whole thing (lectures and coding) in two days. it&#x27;s supposed to give you enough understanding of the concepts to understand the API and apply it.","comments":[{"id":16498564,"user":"graycat","time":1519959077,"time_ago":"8 months ago","type":"comment","content":"<p>If you find something wrong mathematically or otherwise with something I write, then by all means let me know.  So far you have found nothing.  Details:<p>The Google statement I quoted was flatly wrong.  It is really important for students to be told that.<p>I gave some references to more in statistics.<p>&gt; the measure-theoretic issues<p>I didn&#x27;t mention measure theory, and the statistics references I gave don&#x27;t mention measure theory either.  I referenced Fleming only as background on convexity, and there is no measure theory in that part of Fleming.<p>You mentioned the role of calculus for the math of regression:  That use of calculus, for deriving the normal equations, is neither necessary nor, really, sufficient.  There is another derivation, nicer, fully detailed mathematically, with no calculus at all.  The core of the idea is that the minimization of the squared error has to be an orthogonal projection and, then, presto, bingo, get the normal equations.  And there are more advantages to that derivation.  To keep my post simple, I omitted that derivation, but a good treatment of regression without calculus could use it.<p>I omitted the standard definition of convexity, but apparently in this discussion we need that.  By omitting the definition, the Google material was not so good.<p>Definition (convex function):  For the set of real numbers R and a positive integer n, a function f: R^n --&gt; R is <i>convex</i> provided for any u, v in R^n and any a in [0,1] we have<p>f(au + (1-a)v) &lt;= af(u) + (1-a)f(v)<p>So, for a picture, on the graph of f(x), we have two points (maybe not distinct) (u, f(u)) and (v, f(v)).  Then we draw the line between these two points.  The number a determines where we are on that line.  With a = 0, we are at point (v, f(v)).  With a = 1, we are at point (u, f(u)).  Then as we move a from 0 to 1, we move along that line.  We also have on the graph the point, say,\nP<p>(au + (1 - a)v, f( au + (1-a)v ) )<p>And on the line we drew, we have point, say,\nQ<p>(au + (1 - a)v, af(u) + (1-a)f(v))<p>Well, we are asking that point Q be the same as point P or directly above point P.  That is, the line we drew is on or above the graph of (x, f(x)).  The line is sometimes called a <i>secant</i> line and is said to <i>over estimate</i> the function.<p>Definition (concave):\nThe function -f is <i>concave</i> if and only if the function f is convex.<p>As in Fleming, a convex function is continuous. Intuitively, the proof is based on two cones, and as we approach a point we get herded between the two cones.  The cones are from the convexity assumption.  Draw a picture.<p>IIRC, there is a result in Rockafellar that a convex function is differentiable almost surely with respect to Lebesgue measure, but this is the only connection I would make with convexity and measure theory.<p>For convex f, the set of all (x, y) where y &gt;= f(x) is the <i>epigraph</i> of f, that is, the region on or above the graph of f.<p>Definition (convex set):  A subset C of R^n is <i>convex</i> provided for any u, v in C and any a in [0,1] the point<p>au + (1-a)v<p>is also in set A.<p>Well, as in Fleming, the epigraph is convex.  It is also closed in the usual topology of R^n.<p>Definition (closed set):  A subset C of R^n is <i>closed</i> (in the <i>usual topology</i> of R^n) provided for any sequence x_n, n = 1, 2, ... in C that converges to y in R^n, y is also in C.<p>In particular, if we define the <i>boundary</i> of C, set C contains is boundary.  So, the interval [0,1] is closed and the interval (0,1) is not closed.<p>Well, for any closed convex set and point u on its boundary, there exists a hyperplane that passes through point x and where set C is a subset of the closed half space on one side of the hyperplane.<p>Such a hyperplane is said to be <i>supporting</i> for set C at point x.<p>Intuitively, in R^3, push convex set C to be in contact with a wall.  Suppose point x on the boundary of set C is in contact with the wall.  Then the wall is a supporting plane for set C at x, and set C is a subset of the room side of the wall.<p>Or think of a big, solid, irregular piece of cheese and John Belushi as his Samurai Tailor swinging his sword:  John keeps swinging his sword in arcs that are in flat planes and cuts down the irregular cheese to a convex hunk.  So, the convex C has been determined (formed) from the supporting hyperplanes from Belushi&#x27;s sword.<p>For another way to make a convex set, take a piece of wood and press it against a belt sander until the boundary consists of only flat sides.<p>Let a solid rock roll around in a steam of water for a few thousand years, and may end up with a smooth, shiny, convex rock.<p>Faster a chicken egg is convex.<p>In general, a closed convex set is the intersection of its supporting hyperplanes.<p>Then, we can approximate a convex set with some of its supporting hyperplanes.  In particular, we can approximate a convex function with some supporting hyperplanes of its epigraph.  At times, this can be useful -- it&#x27;s the main idea behind Lagrangian relaxation in constrained optimization (I used that once).<p>In particular, the epigraph of a convex function is the intersection of the supporting hyperplanes.  In that case, a supporting hyperplane is called a <i>subgradient</i>.  The function is differentiable at the point of contact if and only if the subgradient is unique.  If the subgradient is unique, then it is just the tangent hyperplane from the gradient of the function.<p>In R^3, a cube is a convex set.  Each of its sides is part of a supporting hyperplane. For a point on the boundary of the cube that is not on an edge, the supporting hyperplane at that point is unique. The corners and edges of the cube also have supporting hyperplanes, but they are not unique.<p>In R^3 a sphere is convex.  Then it is also the intersection of its supporting hyperplanes.  At each point on the boundary of the sphere, the supporting hyperplane is unique.<p>Similarly for epigraphs.<p>So, the function f: R*n --&gt; R where for each x f(x) = 0 is convex, concave, and linear, and each x is both a maximum and a minimum of f.  So, the minimum of a convex function need not be unique.  In this case, the epigraph is just a closed half space.<p>&quot;Look, Ma!  No calculus!&quot;  And no measure theory.<p>Exercise:  Derive the regression normal equations via perpendicular projections and without calculus.<p>Exercise:  Argue the role of perpendicular projections in the minimization in regression.","comments":[{"id":16499173,"user":"aoki","time":1519966890,"time_ago":"8 months ago","type":"comment","content":"<p>my only goal in mentioning the statistics sequence at all was to give a familiar example where the standard sequences vary in depth depending on audience. a trivial point, yes, but i wanted to be concrete because it&#x27;s the internet. apparently that was a terrible choice, as it was far too close to the topic at hand; my apologies for making you search so hard for a connection.<p>i made my request because it&#x27;s jarring for me as a reader when you punctuate your (often delightful) expository writing with conclusions about entire fields and large organizations that seem (on the face of it) to be justified by old and&#x2F;or very limited data.<p>but that&#x27;s a selfish request, and you are of course free to tell me to get lost and post whatever you want (and i&#x27;ll still read it); i&#x27;m certainly not going to pursue this further, aside from the apology and clarifying comment above.","comments":[{"id":16500170,"user":"graycat","time":1519982778,"time_ago":"8 months ago","type":"comment","content":"<p>You do understand that for all the talk and new terminology and claims of &quot;learning&quot; in the &quot;machine learning&quot; (ML) in the Google OP, what is in the OP is a poor introduction to some highly polished material in &quot;regression analysis&quot; in 50 year old books.  So, the ML stuff is adulterated old wine in new bottles with new labels.  That is essentially intellectual theft and corruption, and without references essentially academic plagiarism.  You should be offended.<p>If they are going to plagiarize, even just teach, regression analysis, then at least they shouldn&#x27;t make a mess out of it, and a mess is what they made.  Google should  &quot;get that MESS OFF the Internet&quot;.<p>Students should be told the truth:  Regression is powerful stuff.  Sometimes the results can be valuable.  The Google OP is an introduction to regression and does have some value.  But the Google material is a MESS, and students should be informed that they are getting really low quality material and should see some references to some beautifully polished material.<p>So, I helped any students who would be the target audience for the Google OP.<p>You should know this; I believe you do.<p>I&#x27;m offended by the mess and passing that out to students trying to learn.  You should also be offended.","comments":[{"id":16502916,"user":"diyseguy","time":1520008199,"time_ago":"8 months ago","type":"comment","content":"<p>Google dumbs everything down because they think everyone is dumb.  I have learned to avoid their documentation and attempts to teach the populace.","comments":[],"comments_count":0,"level":5,"url":"item?id=16502916"}],"comments_count":1,"level":4,"url":"item?id=16500170"}],"comments_count":2,"level":3,"url":"item?id=16499173"},{"id":16500186,"user":"graycat","time":1519982987,"time_ago":"8 months ago","type":"comment","content":"<p>Correction of a typo:<p>&gt; So, the function f: R*n --&gt; R where for each x f(x)<p>should read<p>So, the function f: R^n --&gt; R where for each x f(x)<p>Excuse:  Just now I&#x27;m using a keyboard on a laptop, and I&#x27;m not used to the keyboard yet.","comments":[],"comments_count":0,"level":3,"url":"item?id=16500186"}],"comments_count":4,"level":2,"url":"item?id=16498564"}],"comments_count":5,"level":1,"url":"item?id=16497014"},{"id":16494670,"user":"stared","time":1519928964,"time_ago":"8 months ago","type":"comment","content":"<p><a href=\"http:&#x2F;&#x2F;p.migdal.pl&#x2F;2017&#x2F;04&#x2F;30&#x2F;teaching-deep-learning.html\" rel=\"nofollow\">http:&#x2F;&#x2F;p.migdal.pl&#x2F;2017&#x2F;04&#x2F;30&#x2F;teaching-deep-learning.html</a> -&gt; &quot;What mathematicians thing I do&quot;<p>(Full disclaimer - I did theoretical physics, so understand both sides. :))","comments":[],"comments_count":0,"level":1,"url":"item?id=16494670"},{"id":16495487,"user":"telchar","time":1519933680,"time_ago":"8 months ago","type":"comment","content":"<p>You should recheck your definitions on convexity.<p>&gt;function f: R^n --&gt; R where for all x in R^n f(x) = 0<p>This hyperplane is not convex. A convex curve by definition can not be equal to its tangent at any point.<p>Edit: I should specify, I mean a convex curve cannot be completely equal to any of its tangents, obviously it will equal each tangent at a single point.","comments":[{"id":16500127,"user":"graycat","time":1519981996,"time_ago":"8 months ago","type":"comment","content":"<p>You don&#x27;t want to consider just &quot;tangents&quot; and, instead, consider what I defined as supporting hyperplanes of the epigraph and subgradients of the function.  If the gradient exists, that is, if the function is differentiable, then the subgradient really is a tangent.  Otherwise can have many different subgradients <i>supporting</i> at one point on the curve and its epigraph.<p>It&#x27;s simple:  A cube has supporting planes at each point that is an edge or corner, but those points do not have tangents.","comments":[],"comments_count":0,"level":2,"url":"item?id=16500127"},{"id":16495831,"user":"tzs","time":1519935555,"time_ago":"8 months ago","type":"comment","content":"<p>It sounds like you are describing curves that are strictly convex. Curves that are convex, but not strictly convex, can intersect their tangents at more than one point, or even at every point.<p>I&#x27;m going by the definition of convex function given in Rudin&#x27;s &quot;Principles of Mathematical Analysis&quot;, Apostol&#x27;s &quot;Calculus&quot;, Wikipedia, and MathWorld.","comments":[{"id":16496199,"user":"telchar","time":1519937498,"time_ago":"8 months ago","type":"comment","content":"<p>Fair enough. I suppose pointing out that the authors merely omitted &quot;strictly&quot; wouldn&#x27;t have served GP&#x27;s point as well.","comments":[{"id":16498765,"user":"graycat","time":1519961522,"time_ago":"8 months ago","type":"comment","content":"<p>Strictly convex need have no role in this Google ML material.  Just convex is enough.","comments":[],"comments_count":0,"level":4,"url":"item?id=16498765"}],"comments_count":1,"level":3,"url":"item?id=16496199"}],"comments_count":2,"level":2,"url":"item?id=16495831"},{"id":16498759,"user":"graycat","time":1519961450,"time_ago":"8 months ago","type":"comment","content":"<p>&gt; This hyperplane is not convex. A convex curve by definition can not be equal to its tangent at any point.<p>No, my math is fully correct, and your claim is wrong.<p>For a lecture Convexity 101, see my<p><a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=16498564\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=16498564</a>","comments":[],"comments_count":0,"level":2,"url":"item?id=16498759"}],"comments_count":5,"level":1,"url":"item?id=16495487"}],"comments_count":13,"level":0,"url":"item?id=16494499"},{"id":16495267,"user":"suyash","time":1519932379,"time_ago":"8 months ago","type":"comment","content":"<p>Is there something like this for Java programmers?","comments":[{"id":16499006,"user":"lovelearning","time":1519964729,"time_ago":"8 months ago","type":"comment","content":"<p>ML concepts are independent of programming language. I suggest not to let language preferences stand in the way of listening to lectures and understanding the subject.<p>For implementing exercises using Java, you have a bunch of \ngood options:<p>1) The most direct equivalent to Pandas+Tensorflow I can think of is DL4J. They have a good comprehensive set of concept and implementation tutorials [1].<p>2) TF APIs have a Java port and can be used from java desktop and console applications [2]. So a second but slightly more difficult option is using TF Java port + Spark\nAPIs.<p>[1]: <a href=\"https:&#x2F;&#x2F;deeplearning4j.org&#x2F;documentation\" rel=\"nofollow\">https:&#x2F;&#x2F;deeplearning4j.org&#x2F;documentation</a><p>[2]: <a href=\"https:&#x2F;&#x2F;www.tensorflow.org&#x2F;install&#x2F;install_java\" rel=\"nofollow\">https:&#x2F;&#x2F;www.tensorflow.org&#x2F;install&#x2F;install_java</a>","comments":[],"comments_count":0,"level":1,"url":"item?id=16499006"},{"id":16497445,"user":"rripken","time":1519947643,"time_ago":"8 months ago","type":"comment","content":"<p>I think Weka gets used in the java world.\n<a href=\"https:&#x2F;&#x2F;www.cs.waikato.ac.nz&#x2F;ml&#x2F;weka&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cs.waikato.ac.nz&#x2F;ml&#x2F;weka&#x2F;</a>","comments":[],"comments_count":0,"level":1,"url":"item?id=16497445"}],"comments_count":2,"level":0,"url":"item?id=16495267"},{"id":16494103,"user":"neves","time":1519925471,"time_ago":"8 months ago","type":"comment","content":"<p>Which languages and libraries does it use? Is it based in Google libs, like Tensor Flow?","comments":[{"id":16494133,"user":"otoburb","time":1519925565,"time_ago":"8 months ago","type":"comment","content":"<p>Clicking through to the homepage, the full title is: &quot;Machine Learning Crash Course with TensorFlow APIs&quot;.","comments":[],"comments_count":0,"level":1,"url":"item?id=16494133"}],"comments_count":1,"level":0,"url":"item?id=16494103"},{"id":16499465,"user":"earth2mars","time":1519970713,"time_ago":"8 months ago","type":"comment","content":"<p>They do have pre-reqs training material with reference links. <a href=\"https:&#x2F;&#x2F;developers.google.com&#x2F;machine-learning&#x2F;crash-course&#x2F;prereqs-and-prework#prerequisites\" rel=\"nofollow\">https:&#x2F;&#x2F;developers.google.com&#x2F;machine-learning&#x2F;crash-course&#x2F;...</a>","comments":[],"comments_count":0,"level":0,"url":"item?id=16499465"}],"comments_count":232,"url":"https://developers.google.com/machine-learning/crash-course/","domain":"developers.google.com"}